Repository: effektif/admin-docs
Catalog: docs/_locale/*/LC_MESSAGES/index.po
Languages: de

source: Signavio Workflow Accelerator administrators documentation
de: Signavio Workflow Accelerator Administratorenhandbuch

source: Contact and legal information
de: Kontaktinformationen und rechtliche Angaben

source: Registered office of the company
de: Sitz der Gesellschaft

source: Contact
de: Kontakt

source: Phone: 030 / 856 21 54 - 21
de: Telefon: 030 / 856 21 54 - 21

source: Website
de: Internetauftritt

source: Legal information
de: Rechtliche Angaben

source: CEO: Gero Decker
de: Geschäftsführer: Gero Decker

source: VATIN: DE265675123
de: Umsatzsteuer-ID: DE265675123

source: TIN: 27/048/09093
de: Steuernummer: 27/048/09093

source: Register court: Amtsgericht Charlottenburg, HRB 150074 B
de: Registergericht: Amtsgericht Charlottenburg, HRB 150074 B
