Repository: effektif/admin-docs
Catalog: docs/_locale/*/LC_MESSAGES/installation.po
Languages: de

source: If you haven't finished the complete set-up, but at least the web application is running as well, you can test already whether the communication between the mail relay and the web application works. A simple way to do that is to send an email via command line to the mail relay and consult the log file to see the result from the server. The following examples will show you how you can do that on different operating systems. The examples will send an email to a not existing workflow which is referenced by ``process-123``. Therefore, the web application will respond with an error code and you will see a message similar to ``Invalid response status code: 400`` in the log file. This error is expected, as the workflow doesn't exist, and proves the communication is working.
de: Wenn Sie das Setup noch nicht komplett abgeschlossen haben, aber die Webanwendung aufgesetzt ist, können Sie bereits testen, ob die Kommunikation zwischen Mail Relay und Webanwendung funktioniert. Dies können Sie tun, indem Sie eine E-Mail per Kommandozeile versenden und anschliessenden die Log-Datei des Mail Relay überprüfen, um die Antwort der Webanwendung zu sehen. Die folgenden Beispiele zeigen Ihnen, wie Sie diese Aktion mit verschiedenen Betriebssystemen durchführen können. Die Beispiele werden eine E-Mail an einen nicht existierenden Workflow senden, welcher als ``process-123`` referenziert wird. Dementsprechend wird die Webanwendung mit einem Fehlercode antworten, welchen Sie in der Log-Datei finden: ``Invalid response status code: 400``. Dieser Fehler wird erwartet, da der Workflow nicht existiert und beweist, dass die Kommunikation funktioniert.

source: You can send an email using the Windows PowerShell: ::
de: Sie können eine E-Mail mit Hilfe der Windows PowerShell wie folgt versenden: ::

source: Replace the domain of the email address for the ``-To`` parameter with the one you set in the configuration file.
de: Ersetzen Sie die Domain der E-Mail-Adresse des ``-To`` Parameters mit der Domain, die Sie in der Konfigurationsdatei eingetragen haben.

source: You can send an email using telnet to connect to the mail relay.
de: Sie können eine E-Mail versenden, indem Sie sich mit telnet zu dem Mail Relay verbinden.

source: Open a command line on the server which is running the mail relay and execute: ::
de: Öffnen Sie die Kommandozeile auf dem Server, auf dem das Mail Relay ausgeführt wird und führen Sie folgenden Befehl aus: ::

source: Replace the number ``25`` with the respective port that you configured for the mail relay.
de: Ersetzen Sie die Nummer ``25`` mit dem entsprechenden Port, den Sie bei der Konfiguration des Mail Relay festgelegt haben.

source: Afterwards type in the following example line by line and replace the domain in the email for ``rcpt to`` to match the domain you configured for the mail relay.
de: Tippen Sie anschliessend folgendes Beispiel Zeile für Zeile ein und ersetzen Sie dabei die Domain der E-Mail unter ``rcpt to`` mit dem von Ihnen konfigurierten Wert für das Mail Relay.

source: Configuring Workflow Accelerator
de: Workflow Accelerator konfigurieren

source: Install the license file
de: Lizenzinstallation

source: Along with the Workflow Accelerator application you have received the Workflow Accelerator license file license.xml. Before you can start the Workflow Accelerator system, you have to add the license file to the application. Therefore, copy the license file into the directory ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ . The Workflow Accelerator system will check your license file on startup and set up the defined number of licenses.
de: Mit der Workflow Accelerator-Anwendung haben Sie die Lizenzdatei license.xml erhalten. Bevor Sie das System starten können, fügen Sie die Lizenzdatei in das Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes`` ein. Workflow Accelerator überprüft die Datei wenn das System startet und stellt die entsprechenden Lizenzen zur Verfügung.

source: Update the Workflow Accelerator configuration file
de: Die Workflow Accelerator-Konfigurationsdatei aktualisieren

source: Before you can start Workflow Accelerator for the first time, you need to configure some mandatory properties in the Workflow Accelerator configuration file. Make sure you have copied the Workflow Accelerator web application to the Tomcat’s webapps directory before continuing. The configuration file can be found here ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes/effektif-onpremise.properties``\ .
de: Bevor Workflow Accelerator zum ersten Mal gestartet werden kann, müssen einige Variablen in der Workflow Accelerator-Konfigurationsdatei gesetzt werden.Stellen Sie sicher, dass Sie die Workflow Accelerator-Webanwendung in das webapps-Verzeichnis des Tomcats kopiert haben. Die Konfigurationsdatei befindet sich nun unter ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes/effektif-onpremise.properties``\ .

source: The configuration file is a property file that contains one configuration option per line and key and value are separated by a ``=``. Every line that starts with a ``#`` is commented out and will not be used.
de: Die Konfigurationsdatei ist ein „Property File“, welches eine Konfigurationsvariable pro Zeile als “=”-separiertes Key-Value-Paar enthält. Jede Zeile die mit einer Raute „#“ beginnt, ist auskommentiert und wird nicht berücksichtigt.

source: In general, the configuration allows to configure the base URL of the Workflow Accelerator system, the mail server, the database connection and integrations with third party systems (e.g. Signavio). If you installed the Workflow Accelerator Script Engine, you need to configure the URL to the script engine as well. As described in :ref:`install-script-engine` the URL derives from the domain (``localhost`` for the same machine) and port the script engine is running on. If you installed the Workflow Accelerator Mail Relay, you need to enable the email trigger and set the email domain that you created during the set-up.
de: Die Konfigurationsdatei erlaubt die Konfiguration der Basis-URL, des Mail-Servers, der Datenbankverbindung und der Integration von Drittsystemen, zum Beispiel vom Signavio Process Manager. Insofern Sie die Workflow Accelerator Script Engine installiert haben, müssen Sie zusätzlich die URL der Script Engine konfigurieren. Wie bereits in :ref:`install-script-engine` beschrieben, wird die URL aus der Domain (``localhost`` für die gleiche Maschine) und dem Port gebildet unter dem die Script Engine läuft. Insofern Sie das Workflow Accelerator Mail Relay installiert haben, müssen den E-Mail-Auslöser aktivieren und die E-Mail-Domain festlegen, die Sie während der Installation festgelegt haben.

source: (Required) The IP address or server name (including the port) of the server running the Workflow Accelerator Tomcat application server. E.g. http://workflow.yourdomain.com:8080\ . If the server is running on port 80, the port can be omitted.
de: (Pflichtvariable) Die IP-Adresse oder der Servername (inkl. Port) der Workflow Accelerator-Webanwendung, zum Beispiel: http://workflow.yourdomain.com:8080 Falls der Server auf Port 80 läuft, kann auf die Angabe des Ports verzichtet werden.

source: (Required) The IP address or server name of the outgoing email server.
de: (Pflichtvariable) Die IP-Addresse oder der Servername des Emailservers

source: The port on which the outgoing SMTP server listens
de: Der Port des Emailservers

source: If SSL should be used ( true or false )
de: Ob SSL verwendet werden soll ( true oder false )

source: If TLS should be used ( true or false )
de: Ob TLS verwendet werden soll ( true or false )

source: The username for authentication
de: Der Nutzername zur Authentifizierung am Emailserver

source: The password for authentication
de: Das Passwort zur Authentifizierung am Emailserver

source: This email address is used as the sender when the Workflow Accelerator system sends out notifications.
de: Die Sender-E-Mail-Adresse von Workflow Accelerator-Benachrichtigungen und Einladungen.

source: This email address will receive all feedback which is sent using the feedback functionality in the application.
de: Diese E-Mail-Adresse erhält alle Feedback-Nachrichten, welche über die integrierte Feedback-Funktion in der Anwendung gesendet werden.

source: A comma-separated list of MongoDB servers (hostnames). If you have MongodDB running on the same server as Tomcat, the default value of localhost is okay.
de: Eine kommagetrennte List von MongoDB-Servern (Hostnamen). Falls MongoDB auf der Maschine läuft, auf der Tomcat die Effektif-Webanwendung zur Verfügung stellt, kann der Standardwert localhost beibehalten werden.

source: The Workflow Accelerator MongoDB user name. If you created the user following the instructions in this guide, the name is ``signavio``.
de: Der Workflow Accelerator-MongoDB-Nutzername. Falls Sie den Nutzer entsprechend der Anweisungen erstellt haben, ist der name ``signavio`` .

source: The password of the Workflow Accelerator MongoDB user. This is the password you defined during user creation.
de: Das Passwort des MongoDB Nutzers, das bei der Erstellung des Nutzers definiert wurde.

source: The name of the database Workflow Accelerator should use. The default value ``signavio`` is okay.
de: Der Name der Datenbank, die von Workflow Accelerator verwendet werden soll. Der Standardwert ``signavio`` kann beibehalten werden.

source: (Optional) The URL of the Workflow Accelerator Script Engine, e.g. ``http://localhost:8081``\ .
de: (Optional) Die URL der Workflow Accelerator Script Engine, z.B. ``http://localhost:8081``\ .

source: (Optional) Activates the email trigger if set to ``true``. You have to set up the mail relay for the trigger to work properly.
de: (Optional) Aktiviert den E-Mail-Auslöser wenn der Wert auf ``true`` gesetzt wird. Sie müssen das Mail Relay installieren, damit der Auslöser benutzt werden kann.

source: (Optional) The email domain which is used to receive emails for the email trigger. The same value must be configured for the mail relay.
de: (Optional) Die E-Mail-Domain, die genutzt wird, um E-Mails für den E-Mail-Auslöser zu empfangen. Der gleiche Wert muss auch in der Konfiguration des Mail Relay gesetzt sein.

source: The following properties are only relevant if your Workflow Accelerator installation is connected to your Signavio installation. ::
de: Die folgenden Eigenschaften sind nur relevant, falls Workflow Accelerator mit Ihrer Process Manager-Installation verbunden werden soll: ::

source: See :ref:`signavio-integration` for more information on how to set up the integration.
de: Weitere Details zur Signavio-Integration erhalten Sie im Kapitel :ref:`signavio-integration`\ .

source: Configure logging
de: Logging konfigurieren

source: The Workflow Accelerator system has its own application log file ``effektif.log``\ . You need to define the directory where this log file is stored. The directory is specified in the file ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes/logback.xml``\ . Open the file and update the following line: ::
de: Das Workflow Accelerator-System hat mit ``effektif.log`` ein eigenes Logfile. Das Verzeichnis, in dem das Logfile gespeichert wird, kann in der folgenden Datei konfiguriert werden: ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes/logback.xml``\ . Öffnen Sie die datei und passen Sie die folgende Zeile an: ::

source: The value should contain an absolute path. Make sure the user executing Tomcat has the required read / write permissions for the directory.
de: Der Wert sollte einen absoluten Pfad darstellen. Stellen Sie sicher, dass der Nutzer, der Tomcat ausführt Lese- und Schreibzugriff auf das entsprechende Verzeichnis hat.

source: On Windows it necessary to escape all "\\". An example value could like this: ``"C:\\Logs\\Signavio"``\ .
de: Unter Windows ist es notwendig, alle "\\" zu escapen, sodass sich zum Beispiel der folgende Wert ergibt: ``"C:\\Logs\\Signavio"``\ .

source: This configuration file also enables you to change the log level in this file. By default, the log level is INFO. However, in a scenario where you require official support, you will be asked to set the log level to DEBUG. In order to so, update the following: ::
de: In der Konfigurationsdatei können Sie zudem das Loglevel festlegen. Standardmäßig ist das Loglevel INFO. Falls Sie zum Beispiel beim Troubleshooting Support benötigen, ist es sinnvoll, das Loglevel auf DEBUG zu erhöhen. Hierfür muss die folgende Zeile angepasst werden: ::

source: Change it to: ::
de: Der geänderte Eintrag sollte wie folgt aussehen: ::

source: You will need to restart the Tomcat server for the changes to take effect. You can find more detailed information on how to start the Tomcat server in the next section.
de: Sie müssen Ihren Tomcat neustarten, damit die Änderunge aktiv werden. Der nächste Abschnitt gibt Ihnen detailliertere Hinweise, wie sie den Tomcat server starten können.

source: The log file is configured to do a roll over. Every day, a new log file is created which contains a timestamp in the filename similar to ``effektif-2014-10-09.log``\ . The most recent log entries can still be found in the file effektif.log. After 30 days, the log files will be removed automatically.
de: Die Logdatei ist für einen „Roll Over“ konfiguriert. Dies bedeutet, das jeden Tag ein neues Logfile mit einem entsprechenden Zeitstempel erstellt wird, zum Beispiel: ``effektif-2014-10-09.log``\ . Die neuesten Einträge können zudem in der Datei effektif.log eingesehen werden. Logfiles, die älter als 30 Tage sind, werden automatisch gelöscht.
