Repository: effektif/admin-docs
Catalog: docs/_locale/*/LC_MESSAGES/installation.po
Languages: de

source: Installing Signavio Workflow Accelerator
de: Signavio Workflow Accelerator installieren

source: This section will guide you through the set-up of Workflow Accelerator. Simply follow the subsections step by step. If you have already installed Workflow Accelerator and want to update the system to a newer version, you can skip this chapter.
de: Dieses Kapitel behandelt die Installation von Workflow Accelerator. Folgen Sie den detaillierten Beschreibungen und Anweisungen einfach Schritt für Schritt. Wenn Sie Workflow Accelerator bereits installiert haben und das System auf eine neuere Version aktualisieren möchten, dann können Sie dieses Kapitel überspringen.

source: System requirements
de: Systemanforderungen

source: Operating system
de: Betriebssystem

source: The Workflow Accelerator system can be deployed on different operating systems. Officially supported are the following operating systems:
de: Das Workflow Accelerator System kann auf verschiedenen Betriebssystemen bereitgestellt werden. Offiziell werden die folgenden Betriebssysteme unterstützt:

source: In general, it is possible to install Workflow Accelerator on other Linux distributions. However, the installation process can differ from the following instructions and the Signavio team cannot offer official support in case of an installation problem.
de: Es stellt in der Regel kein Problem dar, Workflow Accelerator auf anderen Linux-Distributionen als Debian auszuführen. Der Installationsvorgang kann jedoch von den unten stehenden Anweisungen abweichen und das Signavio Team kann im Falle eines Installationsproblems keinen offiziellen Support bereitstellen.

source: You are advised to use a 64-bit operating system in order to be able to assign more than 1.5GB of heap space to the Java VM. Furthermore, MongoDB is limited to 2GB of content on 32-bit operating systems.
de: Bitte verwenden Sie ein 64-Bit Betriebssystem, damit der Java VM mehr als 1.5GB Heap Space zugewiesen werden können. Zudem ist die Speicherkapazität von MongoDB auf 32-Bit Systemen auf 2GB begrenzt.

source: Hardware requirements
de: Hardwareanforderungen

source: The described installation in this adminstration guide will set up the database and the application server on the same system. However, it is also possible to set up the database and application server on separate systems. For instance, if you already have an infrastructure that provides MongoDB instances for different applications, you can simply reuse your infrastructure and just create another database for Workflow Accelerator.
de: In den vorliegenden Installationsanweisungen werden Datenbank und Webanwendung auf der selben Maschine aufgesetzt. Es ist jedoch möglich, Webanwendung und Datenbank auf verschiedenen Systemen zu installieren, zum Beispiel, falls Sie über eine Maschine MongoDB Datenbanken für verschiedene Anwendungen bereitstellen und dort auch eine Datenbank für Workflow Accelerator erstellen möchten.

source: The minimal hardware requirements for the combined system of application and database server are:
de: Die minimalen Hardwareanforderungen für Webanwendung und Datenbank zusammen sind wie folgt:

source: 4 core CPU
de: 4-Kern CPU

source: 50 GB disk space
de: 50 GB Festplattenspeicherplatz

source: The required disk space depends on how you will use Workflow Accelerator. 50 GB should be sufficient disk space for most scenarios. However, if you plan on using a lot of file uploads in your processes the required disk space depends largely on the number and size of the uploaded files.
de: Der notwendige Festplattenspeicherplatz hängt stark vom Anwendungsszenario ab. 50GB reichen in aller Regel aus. Falls Sie jedoch vorhaben, viele und umfangreiche Dateien im Kontext der Prozessausführung hochzuladen, kann es selbstverständlich vorkommen, dass die notwendige Festplattenkapazität 50GB überschreitet.

source: Note that the required disk space does not include the space necessary for backups. If you plan on storing the backups on the same server, you should add more.
de: Berücksichtigen Sie zudem Backup-Kapazität, insbesondere wenn Sie ein Backup auf dem selben Server speichern möchten.

source: Other systems
de: Weitere Systeme

source: The Workflow Accelerator system relies on a SMTP mail server to send notifications and invite users. You can simply reuse any existing mail server in your organization that supports access via SMTP.
de: Das Workflow Accelerator System benötigt eine Verbindung zu einem SMTP Emailserver, um Benachrichtigungen und Einlandungen an Nutzer zu versenden. In der Regel können Sie einen bereits existierenden Mailserver Ihrer Organisation verwenden.

source: Software requirements
de: Softwareanforderungen

source: In order to run Workflow Accelerator on your server, you will need to install some additional software. Depending on your deployment strategy (combined or separate system for application and database), you have to install the following required software either on the same server or the respective separate servers.
de: Um Workflow Accelerator auf Ihrem Server ausführen zu können, ist es notwendig weitere Software zu installieren (beziehungsweise installiert zu haben). Abhängig von Ihrem Installationsvorhaben ist es notwendig die unten aufgeführte Software auf dem Server, beziehungsweise den Servern, zu installieren.

source: The following sections contain detailed instructions on how to install and configure the additional software components.
de: Die nachfolgenden Kapitel enthalten detaillierte Installations- und Konfigurationsanweisungen für die zusätzliche Software.

source: The application server requires the following additional software:
de: Der Anwendungsserver benötigt die folgende Software:

source: Apache Tomcat 8 64-bit (recommended) or Apache Tomcat 7 64-bit
de: Apache Tomcat 8 64-bit (empfohlen) oder Apache Tomcat 7 64-bit

source: The database server requires the following additional software:
de: Der Datenbankserver benötigt die folgende Software:

source: MongoDB version 3.4.x or higher
de: MongoDB Version 3.4.x oder höher

source: The optional script engine requires the following additional software:
de: Die optionale Script Engine benötigt folgende zusätzliche Software:

source: A current web browser is necessary on every client that shall display the Workflow Accelerator user interface. The following list shows the supported web browsers and versions:
de: Ein relative aktueller Webbrowser auf den Nutzer-PCs ist notwendig, um Workflow Accelerator aufrufen zu können. Die folgenden Browser werden unterstützt:

source: Google Chrome 23 or newer
de: Google Chrome 23 der neuer

source: Mozilla Firefox 10 or newer
de: Mozilla Firefox 10 oder neuer

source: Microsoft Internet Explorer 9 or newer
de: Microsoft Internet Explorer 9 oder neuer

source: Apple Safari 5 or newer
de: Apple Safari 5 oder neuer

source: Unpack Signavio Workflow Accelerator
de: Workflow Accelerator entpacken

source: Unzip the signavio-workflow-{version}.zip to a directory of your choice, e.g. ``/yourlocation/signavio-workflow-{version}`` In the rest of this guide, we'll refer to the Workflow Accelerator home directory as ``$WORKFLOW_HOME``\ . The directory will contain the following files:
de: Entpacken Sie das Archiv signavio-workflow-{version}.zip in einem Verzeichnis Ihrer Wahl, zum Beispiel: ``/yourlocation/signavio-workflow-{version}`` Dieses Verzeichnis wird im weiteren Text als ``$WORKFLOW_HOME`` bezeichnet. Das Verzeichnis enthält die folgenden Dateien:

source: \*.sh - Linux shell scripts
de: \*.sh - Linux Shellskripte

source: db - directory that contains MongoDB configuration files
de: db – Verzeichnis, das die MongoDB Konfigurationsdateien enthält

source: mongod.conf - configuration file for Linux
de: mongod.conf – Konfigurationsdateien für Linux

source: mongod.cfg - configuration file for Windows
de: mongod.cfg - Konfigurationsdateien für Windows

source: mail-relay - directory that contains the mail relay
de: mail-relay – Verzeichnis, das das Mail Relay enthält

source: script-engine - directory that contains the script engine
de: script-engine - Verzeichnis, das die Dateien der Script Engine enthält

source: optional - directory that contains optional resources
de: optional – Verzeichnis, das optional Ressourcen enthält

source: spnego - directory that contains resources to setup SSO with SPNEGO
de: spnego - Verzeichnis, das die Dateien enthält um SSO mit SPNEGO aufzusetzen

source: webapps - directory
de: webapps - Verzeichnis

source: ROOT - this directory contains the web application
de: ROOT - Verzeichnis, das die Webanwendung enthält

source: On Linux systems you need to make the scripts executable with the ``chmod`` command like this: ::
de: Auf Linuxsystemen ist es notwendig, die Shellskripte ausführbar zu machen. Verwenden Sie hierfür den ``chmod``\ -Befehl, wie zum Beispiel: ::

source: Installing Java
de: Java installieren

source: The application server requires a Java runtime environment in order to execute Workflow Accelerator’s Java backend. You must install Java 8 64-bit on the application server. Download an installation package for your operating system here:
de: Der Anwendungsserver benötigt eine Java Ausführungsumgebung, um das Java-Back End von Workflow Accelerator auszuführen. Installieren Sie daher Java 8 64-Bit für Ihr Betriebssystem. Die entsprechenden Dateien erhalten Sie hier:

source: Installing Tomcat
de: Tomcat installieren

source: The Java backend of the Workflow Accelerator system is executed using Apache Tomcat. Workflow Accelerator supports Apache Tomcat 64-bit versions 7 and 8. We recommend using the newer version Tomcat 8.
de: Das Java Back End von Workflow Accelerator wird im Apache Tomcat Webserver ausgeführt. Workflow Accelerator unterstützt die Apache Tomcat 64-Bit Versionen 7 und 8. Wir empfehlen die Nutzung der neueren Version Tomcat 8.

source: You can download the latest installation files for different operating systems from the following site:
de: Die Tomcat-Installationsdateien erhalten Sie für verschiedene Betriebssysteme hier:

source: In general, please make sure the user executing the Tomcat has read/write permissions for the ``$TOMCAT_HOME/webapps`` directory and its sub-directories.
de: Stellen Sie bitte sicher, dass der Tomcat Lese- und Schreibrechte im Verzeichnis ``$TOMCAT_HOME/webapps`` und den enthaltenen Ordnern hat.

source: If you are using a Windows system, the download site offers a Windows Service Installer (“32-bit/64-bit Windows Service Installer”). This installer will install the Apache Tomcat as a Windows service which can be started, stopped and configured over a graphical user interface. The service installer is the recommended way for Windows users to install the Tomcat server. Please, make sure you execute the installer with administrator privileges.
de: Für Windows lässt sich auf der Tomcat-Seite ein Windows Service Installer (“32-bit/64-bit Windows Service Installer”) herunterladen. Dieser Installer richtet Apache Tomcat als Windows Service ein, der über eine Desktopanwendung gestartet, gestoppt und weitgehend konfiguriert werden kann. Führen Sie den Installer mit Administratorrechten aus.

source: Furthermore, it is recommended to install the Apache Tomcat into a root directory on ``C:\``\ .
de: Es wird empfohlen, Apache Tomcat in einem root-Ordner unter ``C:\`` zu installieren.

source: If you are using Linux, consider installing Apache Tomcat using a package manager. On Debian, you can use the Advanced Packaging Tool (APT) and execute one of the following commands: ::
de: Unter Linux ist es empfehlenswert, Apache Tomcat über den Paketmanager zu installieren. Unter Debian bietet sich das Advanced Packaging Tool (APT) an: ::

source: Configuring Tomcat
de: Tomcat konfigurieren

source: This section will point the configuration options that are required to run Workflow Accelerator. However, Tomcat offers more configuration options that can be found in the official documentation:
de: Dieser Abschnitt beschreibt die Konfigurationseinstellungen, die notwendig sind, um Workflow Accelerator auszuführen. Weitere Einstellungen, die Sie eventuell vornehmen möchten, finden Sie hier:

source: Java options
de: Java-Optionen

source: There are some Java options that need to be configured before starting the Tomcat server. These options are configured using the ``JAVA_OPTS`` environment variable. It should contain the following values:
de: Die folgenden Java-Optionen müssen über die ``JAVA_OPTS`` Umgebungsvariable gesetzt werden, bevor Tomcat gestartet wird:

source: minimum RAM, should be at least 1.5GB
de: minimaler RAM, sollte mindestens 1.5GB betragen

source: maximum RAM, should be at least 2GB but more is recommended
de: maximaler RAM, sollte mindestens 2GB betragen, mehr ist jedoch empfehlenswert

source: sets UTF-8 as Apache Tomcat’s default encoding mechanism
de: setzt UTF-8 als den Standard-Encodingsmechanismus des Apache Tomcats

source: initial permanent generation space in MB
de: initialer “Permantent Generation Space” in MB

source: maximum permanent generation space in MB
de: maximaler “Permantent Generation Space” in MB

source: In order to allocate sufficient RAM to the Tomcat server you have to set the ``Xms`` and ``Xmx`` options, followed by the number of MB allocated and a literal ``m``. ``Xms`` defines the initial/minimum amount of RAM that is used and ``Xmx`` the allowed maximum. You are advised to allocate at least 2GB of RAM to the Tomcat. However, it is recommended to use more RAM. For example, if you want to assign 4GB of maximum RAM the option would be ``-Xmx4096m``\ .
de: Um ausreichend RAM für Tomcat zur Verfügung zu stellen, müssen die ``Xms`` und ``Xmx``\ -Optionen gesetzt werden, gefolgt von der MB-Anzahl und dem Buchstaben ``m``\ . ``Xms`` definiert den minimalen RAM, ``Xmx`` den maximalen RAM. Es sollten mindestens 2GB RAM zugewiesen werden, mehr ist jedoch empfehlenswert. Wenn Sie z.B. 4GB maximalen RAM zuweisen möchten, würde die Option wie folgt aussehen: ``-Xmx4096m``

source: The values for the permanent generation space have to be increased as well, these are defined by the values ``-XX:PermSize=128m`` and ``-XX:MaxPermSize=256m``\ .
de: Zudem müssen die Werte für den “Permantent Generation Space” erhöht werden. Hierfür sind die Variablen ``-XX:PermSize=128m`` und ``-XX:MaxPermSize=256m`` zu setzen.

source: If you installed Tomcat using the Windows service installer, you can open the configuration dialog by opening the Windows start menu and selecting ``Program Files\Apache Tomcat\Configure Tomcat``\ .
de: Falls Sie Tomcat über den Windows Installer installiert haben, öffnen Sie nun den Konfigurationsdialog über das ``Startmenü und Programme\Apache Tomcat\Configure Tomcat``\ .

source: The Java tab of the Tomcat configuration dialog
de: Das Java-Tab in Tomcats Konfigurationsdialog

source: The tab Java offers the possibility to set the options and define the memory pool (minimum and maximum RAM usage). Fill in the values for Xms and Xmx into the fields for memory pool and add the other options to the text area labeled as Java Options.
de: Das "Java-Tab" ermöglicht es nun, die entsprechenden Optionen zu setzen. Minimaler und maximaler RAM-Zuweisung werden unter “Initial memory pool” und “Maximum memory pool” definiert. Fügen Sie die verbleibenden Option in das Textfeld "Java Options" ein.

source: One way to define the ``JAVA_OPTS`` under Debian and other Linux distributions is to create the file ``setenv.sh`` in the Tomcat ``/bin/`` directory. This directory contains also other files like the ``catalina.sh``\ , the ``startup.sh`` or the ``shutdown.sh`` und is for instance located in ``/usr/share/tomcat8`` or a similar directory. Simply create or extend any existing setenv.sh file and add the line for ``the JAVA_OPTS``\ : ::
de: Unter Debian und anderen Linux-Distributionen können die ``JAVA_OPTS`` gesetzt werden, indem Sie die Datei ``setenv.sh`` im Verzeichnis Tomcat ``/bin/`` erstellen. In diesem Verzeichnis befinden sich zudem Datein wie ``catalina.sh``\ , ``startup.sh`` und ``shutdown.sh`` und der Pfad ist zum Beispiel ``/usr/share/tomcat8`` oder vergleichbar. Erstellen Sie einfach die Datei ``setenv.sh`` (oder öffen Sie die bestehende Datei) und fügen Sie eine Zeile für die ``JAVA_OPTS`` hinzu: ::

source: In case you have created a new ``setenv.sh`` file, you have to make sure it is executable using the ``chmod`` command: ::
de: Wenn Sie eine neue ``setenv.sh``-Datei erstellt haben, müssen Sie diese noch ausführbar machen. Verwenden Sie hierfür den ``chmod``\-Befehl: ::

source: Set up the Tomcat connector
de: Erstellen des Tomcat Connectors

source: By default the Tomcat server will start up using port 8080 and 8005. Port 8080 is used for serving the Workflow Accelerator web application. Port 8005 is used to shutdown the Tomcat instance. You can change the port in the server.xml which is located in ``$TOMCAT_HOME/conf/server.xml``\ .
de: Tomcat läuft standardmäßig auf den Ports 8080 und 8005, wobei Port 8080 die Workflow Accelerator Webanwendung bereitstellt und Port 8005 zum Herunterfahren der Tomcat-Instanz verwendet wird. Die Ports können in der Datei server.xml geändert werden, die im Verzeichnis ``$TOMCAT_HOME/conf/server.xml`` zu finden ist.

source: If the server is running on any other port than port 80, your users will have to enter the port in the address line of the web browser, e.g. http://workflow.yourdomain.com:8080/\ .
de: Falls der Webserver auf einen anderen Port als Port 80 läuft, muss der Port in der Adressleiste des Browsers referenziert werden, zum Beispiel wie in: http://workflow.yourdomain.com:8080/\.

source: Locate the HTTP connector and change the value of port to your preferred port. Furthermore, make sure the connector contains the entry ``URIEnconding="UTF-8"``\ . For example, the connector could look like this:
de: Machen Sie den HTTP Connector in der server.xml-Datei ausfindig und passen Sie den Wert für den Port nach Ihren Belieben an. Stellen Sie zudem sicher, dass der Connector den Eintrag ``URIEnconding=”UTF-8“``\ . Der Connector könnte z.B. so aussehen:

source: Installing the Workflow Accelerator web application
de: Installieren der Workflow Accelerator Webanwendung

source: The Workflow Accelerator web application, which can be found in the directory ``$WORKFLOW_HOME/workflow/ROOT``, needs to be copied to the Tomcat’s ``webapps`` directory. Remove any files and directories that are located in ``$TOMCAT_HOME/webapps`` and copy the ``ROOT`` directory to ``$TOMCAT_HOME/webapps/``\ .
de: Die Workflow Accelerator Webanwendung, die sich im Ordner ``$WORKFLOW_HOME/workflow/ROOT`` befindet, muss in den ``webapps``\ -Ordner des Tomcats kopiert werden. Entfernen Sie daher alle Dateien aus dem Verzeichnis ``$TOMCAT_HOME/webapps`` und kopieren Sie den Ordner ``ROOT`` nach ``$TOMCAT_HOME/webapps/``\ .

source: The Workflow Accelerator application needs to run as the ROOT application in the Tomcat. Running it in parallel with another application that requires to run as the ROOT application in the same Tomcat is currently not possible.
de: Workflow Accelerator muss als ROOT-Anwendung im Tomcat ausgeführt werden. Daher ist es momentan nicht möglich, eine andere Anwendung, die ebenfalls als ROOT-Anwendung ausgeführt werden muss, im selben Tomcat auszuführen.

source: Installing MongoDB
de: MongoDB installieren

source: MongoDB is currently the only database system that Workflow Accelerator supports. If you already have an infrastructure that can provide a MongoDB version 3.4.x instance, simply create a new instance for Workflow Accelerator and skip to :ref:`configure-mongodb`. Otherwise continue with the installation instructions.
de: MongoDB ist das einzige Datenbanksystem, das momentan von Workflow Accelerator unterstützt wird. Falls Sie bereits ein MongoDB 3.4.x System zur Verfügung stehen haben, können Sie einfach eine neue Instanz für Workflow Accelerator erstellen und zum Abschnitt :ref:`configure-mongodb` springen. Folgen Sie andernfalls den folgenden Anweisungen.

source: General information about installing MongoDB on different operating systems can be found at:
de: Allgemeine Informationen zur Installation von MongoDB 2.4.x erhalten Sie hier:

source: There are two versions of MongoDB, *MongoDB Community Edition* and *MongoDB Enterprise*. *MongoDB Community Edition* can be used free of charge even in a commercial context, whereas *MongoDB Enterprise* is a commercial product that offers additional tooling and support. You can use either version with Workflow Accelerator.
de: Es gibt zwei Versionen von MongoDB, *MongoDB Community Edition* und *MongoDB Enterprise*. *MongoDB Community Edition* kann kostenfrei auch in einem kommerziellen Umfeld genutzt werden, wohingegen *MongoDB Enterprise* ein kommerzielles Produkt ist, welches zusätzliche technische Unterstützung und Support bietet. Für Workflow Accelerator können Sie beide Versionen verwenden.

source: In case you are using Linux, you have the possibilities to install MongoDB using either a package manager like ``apt-get`` or downloading the binaries directly. It is recommened to use the package manager because it will also set up scripts that allow you to start and stop the server easily. However, you have to make sure the correct version is installed. :ref:`install-mongodb-debian` explains in more details how to set up MongoDB on Debian and might work as an example for other Linux distributions.
de: Falls Sie Linux verwenden, können Sie entweder einen Paketmanager wie APT zum Download von MongoDB verwenden oder die Binary-Dateien direkt herunterladen. Wir empfehlen den Download über einen Paketmanager, da hiermit zudem Skripts zum Starten und Stoppen der Anwendung automatisch heruntergeladen und konfiguriert werden. Stellen Sie jedoch sicher, dass Sie die korrekte Version von MongoDB installiert haben. Der Abschnitt :ref:`install-mongodb-debian` erklärt genauer wie MongoDB unter Debian installiert werden kann und kann als Beispiel für andere Linux-Distributionen dienen.

source: Remarks for downloading the binaries
de: Anmerkungen zum Download der Binary-Dateien

source: You can find a version of MongoDB for your operating system here:
de: Sie finden eine Version von MongoDB für Ihr Betriebssystem hier:

source: Windows requires you to download the binaries. Consider the remarks of the last subsection when doing so. If you are using any version older than Windows Server 2008 R2, you have to download the 64-bit legacy release.
de: Unter Windows ist es notwendig, die Binär-Dateien herunterzuladen. Berücksichtigen Sie die oben stehenden Anmerkungen zur Bit Version (64-Bit). Falls Sie eine ältere Windows-Version als Windows Server 2008 R2 verwenden, laden Sie das 64-Bit Legacy Release herunter.

source: You can find more details about installing MongoDB on Windows in the documentation:
de: Weitere Details zur Installation von MongoDB unter Windows finden Sie hier in der MongoDB Dokumenation:

source: When you finished downloading MongoDB follow the next steps:
de: Folgen Sie diesen Schritten, nachdem Sie MongoDB heruntergeladen haben:

source: Start the installation by double-clicking the downloaded MongoDB ``.msi`` and following the instructions.
de: Starten Sie die Installation indem Sie doppelt auf die heruntergeladene MongoDB ``.msi`` klicken und folgen Sie den Anweisungen.

source: You can select another install directory, e.g. ``C:\MongoDB``, if you choose the *Custom* installation option.
de: Sie können ein anderes Installationsverzeichnis auswählen, z.B. ``C:\MongoDB``\ , wenn Sie die *Custom* Installationsoption auswählen.

source: Create a data directory for the MongoDB files, e.g. ``C:\MongoDB\data``\ .
de: Erstellen Sie ein Datenverzeichnis für die MongoDB-Dateien, zum Beispiel: ``C:\MongoDB\data``\ .
