Repository: effektif/admin-docs
Catalog: docs/_locale/*/LC_MESSAGES/installation.po
Languages: de

source: Defines the location and name of the script engine log file. You can an absolute or relative path. By default, the log files are stored in the same directory as the script engine.
de: Legt den Ort und Namen der Script Engine Log-Datei fest. Sie können einen absoluten oder relativen Pfad angeben. Standardmäßig werden die Log-Dateien im Verzeichnis der Script Engine abgelegt.

source: Defines the location and name of the script engine error log file.
de: Legt den Ort und Namen der Script Engine Fehler-Log-Datei fest.

source: After the successful set-up you can start the script engine by opening the ``$SCRIPT_ENGINE_HOME`` directory on a command line and executing the following command ::
de: Nach der erfolgreichen Installation können Sie die Script Engine starten, in dem Sie das Verzeichnis ``$SCRIPT_ENGINE_HOME`` auf der Kommandozeile öffnen und folgenden Befehl ausführen ::

source: Wrapping the Script Engine into a service
de: Die Script Engine als Service registrieren

source: The script engine can be executed as shown above by running the command on a command line. However, it might be useful for production systems to run the script engine as a service or daemon. The following sub sections describe one possibility for each supported operating system which can be used the accomplish this goal. Note, Signavio offers no support for any usage of third-party tools. Use them at your discretion.
de: Die Script Engine kann, wie oben beschrieben, mit der Ausführung eines Befehls auf der Kommandozeile gestartet werden. Für Produktivsysteme ist es jedoch sinnvoll die Script Engine als Service oder Daemon zu betreiben. Der folgende Abschnitt zeigt für jedes unterstützte Betriebssystem eine Möglichkeit um dieses Ziel zu erreichen. Beachten Sie, Signavio bietet keinen Support für die Nutzung von Software von Drittanbietern. Nutzen Sie diese deshalb auf eigene Verantwortung.

source: For Windows there are several software tools which allow you to wrap a script into a service and monitor the execution. The `Non-Sucking Service Manager <http://nssm.cc/>`_ (NSSM) is such a free tool which allows you to wrap any executable into a Windows service.
de: Für Windows existieren mehrere Softwarelösungen, die es erlauben ein Skript als Service zu registrieren und die Ausführung zu überwachen. Der `Non-Sucking Service Manager <http://nssm.cc/>`_ (NSSM) ist ein entsprechendes Programm, welches es erlaubt beliebige ausführbare Dateien als Service zu registrieren.

source: Download NSSM from http://nssm.cc/download
de: Laden Sie NSSM von http://nssm.cc/download herunter

source: Create a new local installation directory for NSSM, e.g. ``C:\Program Files\NSSM``.
de: Legen Sie ein neues lokales Verzeichnis für NSSM an, z.B. ``C:\Program Files\NSSM``.

source: Unzip the downloaded file and copy either the 64-bit ``win64\nssm.exe`` or the 32-bit ``win32\nssm.exe`` file to your new local directory.
de: Entpacken Sie die heruntergeladene Datei und kopieren Sie entweder die 64-Bit ``win64\nssm.exe`` oder die 32-Bit ``win32\nssm.exe`` Datei in Ihr neues lokales Verzeichnis.

source: Add the installation directory of NSSM to the environment variable ``PATH`` in the Windows system settings.
de: Fügen Sie das Installationsverzeichnis von NSSM zu der Umgebungsvariable ``PATH`` in den Windows Systemeinstellungen hinzu.

source: This is necessary to use the ``nssm`` executable on the command line without an absolute path.
de: Dies ist notwendig um den ``nssm`` Befehl auf der Kommandozeile ohne absoluten Pfad ausführen zu können.

source: Open the command line ``cmd`` with administrative privileges.
de: Öffnen Sie die Kommandozeile ``cmd`` mit Administratorrechten.

source: Execute ``nssm install script-engine``.
de: Führen Sie ``nssm install script-engine`` aus.

source: The NSSM configuration dialog open
de: Der NSSM Konfigurationsdialog öffnet sich

source: In the *Application* tab fill in the following information:
de: In dem Tab *Application* fügen Sie folgende Informationen hinzu:

source: *Path*: the path to the Node.js .exe file, e.g. ``C:\Program Files\nodejs\node.exe``
de: *Path*: der Pfad zu der Node.js .exe Datei, z.B. ``C:\Program Files\nodejs\node.exe``

source: *Startup directory*: the value of ``$SCRIPT_ENGINE_HOME``, e.g. ``C:\Program Files\Script Engine``.
de: *Startup directory*: das richtige Verzeichnis von ``$SCRIPT_ENGINE_HOME``, z.B. ``C:\Program Files\Script Engine``.

source: *Arguments*: the exact value ``server.js``
de: *Arguments*: der genaue Wert ``server.js``

source: In the *Details* tab fill in the following information:
de: In dem Tab *Details* fügen Sie folgende Informationen hinzu:

source: *Display name*: the name of the service shown in ``services.msc``
de: *Display name*: der Name des Service, welcher in ``services.msc`` angezeigt wird

source: *Description*: a description which will help you to recognise the service
de: *Description*: eine Beschreibung, die Ihnen dabei hilft den Service wieder zu erkennen

source: *Startup type*: choose if the service shall start automatically on startup or if you want to start it manually
de: *Startup type*: wählen Sie ob der Service automatisch beim Systemstart oder manuell gestartet werden soll

source: Fill in any other service configuration settings you deem appropriate for your system in the other tabs.
de: Füllen Sie je nach Bedarf weitere Informationen in die anderen Tabs, die Sie für die Ausführung auf Ihrem System als notwendig erachten.

source: Click on *Install service*.
de: Klicken Sie auf *Install service*.

source: Now you can start the script engine with the following command: ::
de: Nun können Sie die Script Engine mit dem folgenden Befehl starten: ::

source: You can check the status of the script engine by executing: ::
de: Sie können den Status der Script Engine mit dem folgenden Befehl überprüfen: ::

source: In order to stop the script engine again, execute the following command: ::
de: Um die Script Engine wieder zu stoppen, führen Sie den folgenden Befehl aus: ::

source: While it is running, you can open your browser and go to the URL you have configured for the script engine, by default this ``http://localhost:8081``. If the engine is running, you will see a blank page with this content: ``{}``
de: Solange die Script Engine ausgeführt wird, können Sie in Ihrem Browser die URL der Script Engine aufrufen, welche Sie in der Konfigurationsdatei festgelegt haben. Standardmäßig lautet die URL ``http://localhost:8081``. Wenn die Script Engine läuft, werden Sie eine leere Seite mit folgendem Inhalt sehen: ``{}``

source: Besides using ``nssm`` on the command line, you will find a new service when you open the ``services.msc``. The script engine will show up under the name you configured as display name. You can start and stop the script engine from here as well.
de: Als Alternative zu der Nutzung von ``nssm`` auf der Kommandozeile, können Sie die Script Engine auch über den Service in ``services.msc`` steuern und z.B. starten und stoppen. Die Script Engine wird unter dem Namen verfügbar sein, welchen Sie als Anzeigenamen konfiguriert haben.

source: On Linux this task is usually accomplished with Init scripts using the respective Init system of your Linux distribution. Because there are several different Init systems, Signavio will not provide a template. However, if you don't already have a template, you can find lots of matching templates for your Init system on the internet.
de: Auf Linux-Systemen wird diese Aufgabe meist durch Init-Skripte gelöst, die das Init-System der jeweiligen Distribution nutzen. Da es mehrere verschiedene Init-Systeme gibt, stellt Signavio kein Template für ein entsprechendes Skript zur Verfügung. Für den Fall, dass Sie selbst noch kein Template besitzen, finden Sie im Internet zahlreiche Beispiele für die verschiedenen Init-Systeme.

source: As mentioned before, the script engine can be started from within ``$SCRIPT_ENGINE_HOME`` by executing: ::
de: Wie bereits erwähnt, kann die Script Engine mit folgendem Befehl aus dem Verzeichnis ``$SCRIPT_ENGINE_HOME`` gestartet werden: ::

source: You have to ensure your Init script starts the Node.js executable ``node`` and uses the JavaScript file ``$SCRIPT_ENGINE_HOME/server.js`` as an argument. Note, if you use a restricted user to execute the command, make sure the user has appropriate access to the ``$SCRIPT_ENGINE_HOME`` directory.
de: Sie müssen sicher stellen, dass Ihr Init-Skript die Node.js Programmdatei ``node`` startet und die JavaScript-Datei ``$SCRIPT_ENGINE_HOME/server.js`` als Argument nutzt. Beachten Sie, wenn Sie einen Nutzer mit eingeschränkten Rechten für die Ausführung nutzen, dann muss dieser entsprechenden Zugriff auf das ``$SCRIPT_ENGINE_HOME`` Verzeichnis haben.

source: Installing the Workflow Accelerator Mail Relay
de: Workflow Accelerator Mail Relay installieren

source: You only need to install and configure the Mail Relay if you purchased a version of Workflow Accelerator which allows you to use email triggers.
de: Sie müssen das Mail Relay nur installieren und konfigurieren, wenn Sie eine Version von Workflow Accelerator erworben haben, welche die Verwendung des E-Mail-Auslösers erlaubt.

source: The mail relay is a SMTP server which receives emails and forwards them via HTTP to the Workflow Accelerator web application. It is required in order to start a workflow by email. If you don't plan on starting workflows by email, you don't have to set this component up and can skip this section.
de: Das Mail Relay ist ein SMTP-Server, welcher E-Mails per HTTP an die Workflow Accelerator-Webanwendung weiterleitet. Es wird benötigt, um Workflows per E-Mail zu starten. Sollten Sie nicht vorhaben, Workflows per E-Mail zu starten, dann müssen Sie diese Komponente nicht aufsetzen und können diesen Abschnitt überspringen.

source: The complete set-up of the mail relay consists of the following steps:
de: Das komplette Setup des Mail Relay umfasst folgende Schritte:

source: Create an email domain for the mail relay
de: Eine E-Mail-Domain für das Mail Relay anlegen

source: Install and configure the mail relay
de: Das Mail Relay installieren und konfigurieren

source: Configure the web application
de: Die Webanwendung konfigurieren

source: In order to work properly, the mail relay needs to receive all relevant emails. The used email addresses are created dynamically based on the ID of the workflow that should be started. The domain used for the email addresses can be chosen by you and has to be configured in the system. We advise that you create a specific subdomain which is different from your normal email domain and redirect any incoming emails to the mail relay.
de: Damit das Mail Relay wie erwartet funktioniert, muss es alle relevanten E-Mails empfangen. Die genutzten E-Mail-Adressen werden dynamisch, basierend auf der ID des zu startenden Workflows erzeugt. Die Domain, die für die E-Mail-Adressen genutzt wird, kann von Ihnen frei gewählt und muss im System konfiguriert werden. Wir raten dazu eine gesondert Subdomain anzulegen, die sich von Ihrer normalen E-Mail-Domain unterscheidet und dann entsprechend alle eingehenden E-Mails für diese Domain an das Mail Relay zu leiten.

source: For example if you use the email domain ``mail.yourcompany.com``, a typical email address for the workflow system would look like this: ::
de: Wenn Sie z.B. die E-Mail-Domain ``mail.yourcompany.com`` verwenden, würde eine typische E-Mail-Adresse des Workflow-Systems wie folgt aussehen: ::

source: How you route the emails to the mail relay is up to you and depends on your infrastructure. If the server which runs the mail relay is publicly available, you can simply set up a respective `MX record <https://en.wikipedia.org/wiki/MX_record>`_\ . Note, the mail relay and the Workflow Accelerator web application don't have to run on the same server. If your email server (e.g. Microsoft Exchange) allows rerouting traffic for a specific subdomain to another server, you can also set up a respective rule there. Please, make sure the email is not modified and for instance the sender address is not changed due to some forwarding mechanism.
de: Wie Sie die E-Mails zum Mail Relay leiten, ist Ihnen überlassen und hängt stark von Ihrer Infrastruktur ab. Wenn z.B. der Server, auf dem das Mail Relay ausgeführt wird, öffentlich verfügbar ist, können Sie einfach einen entsprechenden `MX-Record <https://en.wikipedia.org/wiki/MX_record>`_ aufsetzen. Beachten Sie bitte, dass das Mail Relay und die Workflow Accelerator-Webanwendung nicht auf dem gleichen Server ausgeführt werden müssen. Wenn Ihr E-Mail-Server (z.B. Microsoft Exchange) das Umleiten von E-Mails für spezielle Subdomains zu anderen Servern erlaubt, dann können Sie auch dort eine entsprechende Regel einrichten. Stellen Sie bitte sicher, dass die E-Mail dabei nicht verändert wird und so z.B. auch der ursprüngliche Absender erhalten bleibt und nicht durch die Weiterleitung verändert wird.

source: The next subsection explains how you set up the mail relay and configure it to use your email domain.
de: Der nächste Abschnitt erklärt, wie Sie das Mail Relay aufsetzen und Ihre E-Mail-Domain hinein konfigurieren.

source: The mail relay comes as a JAR file which requires Java 8 for the execution. Please, make sure Java 8 is installed before continuing with the set-up.
de: Das Mail Relay wird als JAR-Datei ausgeliefert und erfordert Java 8 für die Ausführung. Stellen Sie bitte sicher, dass Java 8 installiert ist, bevor sie mit dem Setup fortfahren.

source: The mail relay can be installed on the same server as the Workflow Accelerator web application or on a different server. If you choose two different servers, please ensure the mail relay is able to reach the server which runs the web application.
de: Das Mail Relay kann auf dem gleichen Server installiert werden wie die Workflow Accelerator-Webanwendung. Sie können aber auch beide Komponenten auf unterschiedlichen Servern installieren. Stellen Sie jedoch sicher, dass das Mail Relay ein Verbindung zu der Webanwendung herstellen kann.

source: Create a new local directory for the mail relay, e.g. ``C:\Program Files\Mail Relay`` or ``/var/lib/mail-relay``.
de: Legen Sie ein neues lokales Verzeichnis für das Mail Relay an, z.B. ``C:\Program Files\Mail Relay`` oder ``/var/lib/mail-relay``.

source: We will refer to this directory as ``$MAIL_RELAY_HOME``.
de: Im folgenden wird dieses Verzeichnis als ``$MAIL_RELAY_HOME`` referenziert.

source: Copy the contents of the directory ``$WORKFLOW_HOME/mail-relay/`` to your newly created directory.
de: Kopieren Sie den Inhalt des Verzeichnisses ``$WORKFLOW_HOME/mail-relay/`` in Ihr neu angelegtes Verzeichnis.

source: You should find the file ``mail-relay.jar`` directly within your directory: ``$MAIL_RELAY_HOME/mail-relay.jar``.
de: Die Datei ``mail-relay.jar`` sollte sich direkt in Ihrem Verzeichnis befinden: ``$MAIL_RELAY_HOME/server.js``.

source: Within the ``$MAIL_RELAY_HOME`` directory create a new directory ``logs``.
de: Legen Sie innerhalb des Verzeichnisses ``$MAIL_RELAY_HOME`` ein neues Verzeichnis ``logs`` an.

source: Open ``$MAIL_RELAY_HOME/logback.xml`` and edit ``value`` in the following line: ::
de: Öffnen Sie ``$MAIL_RELAY_HOME/logback.xml`` und ändern Sie den Eintrag ``value`` in der folgenden Zeile: ::

source: Set ``value`` to the absolute path of ``$MAIL_RELAY_HOME/logs``.
de: Setzen Sie den Wert von ``value`` auf den absoluten Dateipfad von ``$MAIL_RELAY_HOME/logs``.

source: For example ``C:\\Program Files\\Mail Relay\\logs`` or ``/var/lib/mail-relay/logs``
de: Z.B. ``C:\\Program Files\\Mail Relay\\logs`` oder ``/var/lib/mail-relay/logs``

source: On Windows you have to use ``\\`` as a separator for the path.
de: Unter Windows müssen ``\\`` als Trennzeichen für den Pfad nutzen.

source: Open ``$MAIL_RELAY_HOME/mail-relay.properties`` and edit the values for the domain, port and Workflow Accelerator URL.
de: Öffnen Sie ``$MAIL_RELAY_HOME/mail-relay.properties`` und passen Sie die Werte für die Domain, den Port und die Workflow Accelerator URL an.

source: Ensure that the port for the mail relay is not used by any other application.
de: Stellen Sie sicher, dass der Port für das Mail Relay nicht bereits von einer anderen Anwendung genutzt wird.

source: Defines the (sub)domain which is used to receive emails for Workflow Accelerator.
de: Definiert die (Sub-)Domain, welche für den Empfang von E-Mails für Workflow Accelerator genutzt wird.

source: Defines the URL of the Workflow Accelerator web application.
de: Legt die URL der Workflow Accelerator Webanwendung fest.

source: Defines the port the SMTP will use and listen to.
de: Legt den Port fest, welchen der SMTP-Server verwenden wird.

source: After the successful set-up you can start the mail relay by opening the command line and executing the following command ::
de: Nach der erfolgreichen Installation können Sie das Mail Relay starten, in dem Sie die Kommandozeile öffnen und folgenden Befehl ausführen ::

source: Replace ``$MAIL_RELAY_HOME`` with the absolute path to the JAR file.
de: Ersetzen Sie ``$MAIL_RELAY_HOME`` mit dem absoluten Dateipfad zu der JAR-Datei.

source: You can also register a new service or set up a new Linux Init script depending on your operating system to ease the management of the mail relay.
de: Um das Management vom Mail Relay zu vereinfachen, können Sie auch einen entsprechenden Service registrieren oder ein Linux-Init-Skript aufsetzen, abhängig von Ihrem Betriebssystem.

source: Section :ref:`wrap-into-service` explains how you can wrap a single command into a service using NSSM. If you installed NSSM previously, you don't need to install it again. Simply follow the instructions and replace the details for the script engine with the details for the mail relay:
de: Abschnitt :ref:`wrap-into-service` erklärt bereits wie Sie ein einzelnes Kommando unter Verwendung von NSSM als Service registrieren können. Wenn Sie bereits NSSM installiert haben, dann müssen Sie dies nicht erneut tun. Folgen Sie einfach den Anweisungen in dem Abschnitt und ersetzen Sie die Details für die Script Engine mit den Details für das Mail Relay.

source: Open a command line with administrator privileges and execute: ::
de: Öffnen Sie die Kommandozeile ``cmd`` mit Administratorrechten und führen Sie folgenden Befehl aus: ::

source: *Path*: the path to the Java .exe file, e.g. ``C:\Program Files\Java\jre1.8.0_92\bin\java.exe``
de: *Path*: der Pfad zu der Java .exe Datei, z.B. ``C:\Program Files\Java\jre1.8.0_92\bin\java.exe``

source: *Startup directory*: the value of ``$MAIL_RELAY_HOME``, e.g. ``C:\Program Files\Mail Relay``.
de: *Startup directory*: das richtige Verzeichnis von ``$MAIL_RELAY_HOME``, z.B. ``C:\Program Files\Mail Relay``.

source: *Arguments*: the exact value ``-jar mail-relay.jar``
de: *Arguments*: der genaue Wert ``-jar mail-relay.jar``

source: After the successful registration, you can start the mail relay similarly to the script engine either on command line or via ``services.msc``.
de: Nach der erfolgreichen Registrierung können Sie das Mail Relay ähnlich wie die Script Engine entweder per Kommandozeile oder via ``services.msc`` starten.

source: Similar to the script engine, for the mail relay this task is usually accomplished with Init scripts using the respective Init system of your Linux distribution. Because there are several different Init systems, Signavio will not provide a template. However, if you don't already have a template, you can find lots of matching templates for your Init system on the internet.
de: Vergleichbar mit der Script Engine, wird diese Aufgabe meist mit Hilfe von Init-Skripten für das jeweilige Init-System Ihrer Linux-Distribution umgesetzt. Da es mehrere verschiedene Init-Systeme gibt, stellt Signavio kein Template für ein entsprechendes Skript zur Verfügung. Für den Fall, dass Sie selbst noch kein Template besitzen, finden Sie im Internet zahlreiche Beispiele für die verschiedenen Init-Systeme.

source: As mentioned before, the mail relay can be started by executing: ::
de: Wie bereits erwähnt, kann das Mail Relay mit folgendem Befehl gestartet werden: ::

source: The placeholder ``$MAIL_RELAY_HOME`` has to be replaced with the absolute path to the JAR file.
de: Der Platzhalter ``$MAIL_RELAY_HOME`` muss durch den absoluten Dateipfad zu der JAR-Datei ersetzt werden.

source: You have to ensure your Init script starts the Java executable and uses the arguments ``-jar`` and the absolute path to JAR file ``mail-relay.jar``. Note, if you use a restricted user to execute the command, make sure the user has appropriate access to the ``$MAIL_RELAY_HOME`` directory.
de: Stellen Sie sicher, dass Ihr Init-Skript Java ausführt und die Argumente ``-jar`` sowie den absoluten Dateipfad zu der JAR-Datei ``mail-relay.jar`` verwendet. Wenn Sie für das Skript einen Nutzer mit eingeschränkten Rechten verwenden, stellen Sie bitte sicher, dass dieser Zugriff auf das Verzeichnis ``$MAIL_RELAY_HOME`` hat.

source: After setting up the mail relay, the email trigger needs to be enabled in the web application configuration. Section :ref:`update-effektif-configuration` explains where you find the respective configuration file. Make sure to set proper values for the following configuration values: ::
de: Nach dem Aufsetzen des Mail Relay muss der E-Mail-Auslöser in der Konfiguration der Webanwendung aktiviert werden. Abschnitt :ref:`update-effektif-configuration` beschreibt wo die entsprechende Konfigurationsdatei zu finden ist. Stellen Sie sicher, dass für die folgenden Einstellungen gültige Werte konfiguriert sind: ::

source: The first value must be set to ``true`` to enable the email trigger. The second value must be set to the email domain you created for the mail relay. It will be shown in the user interface of the web application.
de: Der erste Wert muss auf ``true`` gesetzt werden, um den E-Mail-Auslöser zu aktivieren. Für den zweiten Wert müssen Sie die E-Mail-Domain konfigurieren, die Sie für das Mail Relay angelegt haben. Diese wird in der Nutzeroberfläche der Webanwendung angezeigt.

source: Testing the mail relay
de: Das Mail Relay testen

source: In order to verify the set-up works as intended, it can be helpful to test it. If you have installed Workflow Accelerator completely and created an organization within the application, you can directly test the set-up with a workflow.
de: Um sicherzustellen, dass das Setup wie erwartet funktioniert, ist es von Vorteil das Setup zu testen. Wenn Sie Workflow Accelerator komplett installiert und bereits eine Organisation in der Anwendung erstellt haben, können Sie das Setup direkt mit einem Workflow testen.

source: Create a new workflow
de: Erzeugen Sie einen neuen Workflow

source: Choose the email trigger
de: Wählen Sie den E-Mail-Auslöser aus

source: Copy the email address which is shown in the UI
de: Kopieren Sie die E-Mail-Adresse, die in der Nutzeroberfläche angezeigt wird

source: Publish the workflow
de: Veröffentlichen Sie den Workflow

source: Send an email to the copied email address
de: Senden Sie eine E-Mail an die kopierte E-Mail-Adresse

source: The case list should now contain a new completed case which shows your email in the event stream. If no case was started, you should check the log file ``$MAIL_RELAY_HOME/logs/mail.log`` for any error message.
de: In der Fallübersicht sollte nun ein neuer, bereits abgeschlossener Fall zu sehen sein. Dieser Fall enthält die Information Ihrer E-Mail im Ereignisfeed. Wenn kein Fall gestartet wurde, dann überprüfen Sie bitte die Log-Datei ``$MAIL_RELAY_HOME/logs/mail.log`` auf Fehlernachrichten.
