Repository: effektif/admin-docs
Catalog: docs/_locale/*/LC_MESSAGES/installation.po
Languages: de

source: This directory will need the most disk space. Make sure the drive has sufficient disk space.
de: Dieses Verzeichnis wird einen Großteil des benötigten Festplattenspeichers verwenden. Stellen Sie daher sicher, dass das Laufwerk genügend Speicehrplatz zur Verfügung stellt.

source: Create a logs directory for the MongoDB log files, e.g. ``C:\MongoDB\logs``\ .
de: Erstellen Sie ein Verzeichnis für die MongoDB Log-Dateien, zum Beispiel ``C:\MongoDB\logs``\ .

source: Copy the file ``$WORKFLOW_HOME\db\mongod.cfg`` to your MongoDB directory ``C:\MongoDB\mongod.cfg`` and edit the file.
de: Kopieren Sie die Konfigurationsdatei aus ``$WORKFLOW_HOME\db\mongod.cfg`` in das MongoDB-Verzeichnis ``C:\MongoDB\mongod.cfg`` und bearbeiten Sie die Datei.

source: The ``dbPath`` under ``storage`` must contain the absolute path to the data directory, e.g. ``C:\MongoDB\data``\ .
de: Die Variable ``dbPath`` unter ``storage`` muss den absoluten Pfad zum Datenverzeichnis enthalten, zum Beispiel ``C:\MongoDB\data``\ .

source: The ``path`` under ``systemLog`` must contain the absolute path to the log file, e.g. ``C:\MongoDB\logs\mongodb.log``\ . The log file will be created once MongoDB is started.
de: Die Variable ``path`` unter ``systemLog`` muss den absoluten Pfad zum Logverzeichnis enthalten, zum Beispiel ``C:\MongoDB\logs\mongodb.log``\ . Die Logdatei wird beim Starten von MongoDB erstellt (beziehungsweise, falls vorhanden, ergänzt).

source: The configuration file needs to be in a valid `YAML <http://yaml.org>`_ format. You can use an online checker like `YAML Lint <http://www.yamllint.com/>`_ to verify the validity.
de: Die Konfigurationsdatei muss einem gültigen `YAML <http://yaml.org>`_ Format entsprechen. Sie können einen Online Checker wie `YAML Lint <http://www.yamllint.com/>`_ verwenden, um das Format zu überprüfen.

source: See :ref:`configure-mongodb` for more information about the other configuration values.
de: Im Abschnitt :ref:`configure-mongodb` werden weitere Konfigurationsoptionen beschrieben.

source: Open the command line ``cmd`` with administrative privileges and execute the following command. Make sure to use absolute paths and replace them with the matching ones on your system.
de: Öffnen Sie das Windows Kommandozeilentool ``cmd`` mit Administratorenrechten und führen Sie das folgende Kommando aus. Stellen Sie dabei sicher, dass die Pfade den von Ihnen konfigurierten absoluten Pfaden entsprechen.

source: The command line should tell you that the service MongoDB was properly created.
de: Das Kommandozeilentool sollte Ihnen bestätigen, dass der MongoDB Service erfolgreich registriert wurde.

source: You can unregister the service again by executing: ``C:\MongoDB\bin\mongod.exe --remove``
de: Mit dem folgenden Befehl können Sie den Service wieder entfernen: ``C:\MongoDB\bin\mongod.exe --remove``

source: The registered service should start MongoDB automatically on startup of Windows.
de: Der Service wird MongoDB nach dem Starten von Windows automatisch ausführen.

source: You can now start MongoDB by executing the following command: ``net start MongoDB``
de: Mit dem folgenden Befehl können Sie MongoDB nun direkt ausführen: ``net start MongoDB``

source: You can stop MongoDB by calling: ``net stop MongoDB``
de: Der folgende Befehl stoppt MongoDB: ``net stop MongoDB``

source: The service is also listed in the services window that can be opened by running ``services.msc``\ .
de: Der MongoDB Service ist nun auch unter der Serviceverwaltung gelistet, die über ``services.msc`` aufgerufen werden kann.

source: If you are installing MongoDB on a Debian system, you are advised to use the method described in the MongoDB configuration:
de: Falls Sie MongoDB unter Debian installieren, halten Sie sich bitte an die folgenden Anweisungen:

source: For convenience, the script ``$WORKFLOW_HOME/mongodb.install.debian.sh`` wraps the necessary commands for installing the correct version of MongoDB on *Debian 8 Jessie* using ``apt-get``. Simply execute it from the command line by opening ``$WORKFLOW_HOME`` and calling: ::
de: Das Skript ``$WORKFLOW_HOME/mongodb.install.debian.sh`` enthält alle notwendigen Befehle, um die richtige Version von MongoDB über APT auf *Debian 8 Jessie* zu installieren. Führen Sie das Skript aus, indem Sie in das Verzeichnis ``$WORKFLOW_HOME`` wechseln und den folgenden Befehl ausführen: ::

source: This will add the MongoDB repositories to your package sources and install the version 3.4.x of MongoDB. Note that this script only works with Debian 8 Jessie. The official documentation offers instructions for Debian 7 Wheezy as well. You can now simply start and stop the MongoDB server by calling ::
de: Hierdurch werden die MongoDB Repositories zu Ihren Package Sources hinzugefügt und Version 3.4.x von MongoDB installiert. Beachten Sie, das bereitgestellte Skript funktioniert nur mit Debian 8 Jessie. In der offiziellen Dokumentation finden Sie weitere Hinweise für Debian 7 Wheezy. Nun können Sie MongoDB mit den folgenden Befehlen stoppen und starten: ::

source: or ::
de: oder ::

source: The server will use the default configuration file ``/etc/mongod.conf``\ . See the next subsection for more information on how to configure MongoDB for Workflow Accelerator and create the required user. Note that the installation probably already started the MongoDB server. You will need to restart the MongoDB server after you edit the configuration.
de: Der Server greift dabei auf die Standardkonfiguration in der Datei unter ``/etc/mongod.conf`` zurück. Der nächste Abschnitt enthält detaillierte Informationen zur Konfiguration und Nutzererstellung von MongoDB. Beachten Sie, dass MongoDB nach der Installation wahrscheinlich schon gestartet wurde. Stellen Sie sicher, dass Sie MongoDB nach Änderungen in der Konfiguration neu starten.

source: Configuring MongoDB
de: MongoDB konfigurieren

source: In order to run MongoDB properly, some configuration options have to be defined. The easiest solution is to create a configuration file and link this configuration file when starting MongoDB with the ``--config`` option. The MongoDB configuration uses the `YAML <http://yaml.org>`_ format, you can use an online checker like `YAML Lint <http://www.yamllint.com/>`_ to verify that your configuration file has the proper format.
de: Um MongoDB ordnungsgemäß auszuführen, müssen einige Konfigurationseinstellungen gesetzt werden. Der einfachste Weg die Konfiguration vorzunehmen, ist eine Konfigurationsdatei zu erstellen und diese beim Starten von MongoDB über die ``--config`` Option zu verlinken. Die MongoDB Konfiguration nutzt das `YAML <http://yaml.org>`_ Format. Sie können einen Online Checker wie `YAML Lint <http://www.yamllint.com/>`_ verwenden, um das Format Ihrer Konfigurationsdatei zu überprüfen.

source: If you installed MongoDB under Windows using the method in the last section, you have already copied the predefined configuration file and adjusted the values for ``dbPath`` and ``systemLog`` ``path`` to your system. Then your configuration file already contains all necessary values.
de: Falls Sie MongoDB unter Windows wie oben beschrieben installiert haben, haben Sie bereits eine Konfigurationsdatei erstellt und die Werte für ``dbPath`` und ``systemLog`` ``path`` angepasst, sodass sie die richtigen Werte enthält.

source: If you installed MongoDB under Linux using ``apt-get``, e.g. by following the instructions in the last section, there should be a ``/etc/mongod.conf`` configuration file. Edit this configuration file. The ``dbPath``, ``systemLog`` ``path`` properties should already be defined. It is recommened to set the ``logAppend`` property to ``true`` and the ``authorization`` property to ``enabled``.
de: Falls Sie MongoDB unter Linux wie oben beschrieben mit APT installiert haben, befindet sich eine Konfigurationsdatei unter ``/etc/mongod.conf``\ . Bearbeiten Sie diese Datei. Die Parameter ``dbPath`` und ``systemLog`` ``path`` sollten bereits definiert sein. Wir empfehlen die Variablen ``logAppend`` auf ``true`` und ``authorization`` auf ``enabled`` zu setzen.

source: In any other case make sure the configuration file contains the following properties. ::
de: Stellen Sie im Falle einer abweichenden Installationsprozedur sicher, dass die folgenden Einträge korrekt gesetzt sind: ::

source: Defines the directory where the database files are stored.
de: Definiert das Verzeichnis, in dem die Daten gespeichert werden.

source: Defines the file that will contain the logging output.
de: Definiert das Logverzeichnis.

source: Indicates that new logs will be appended to an existing log file after restarting the server, if set to true.
de: Falls auf “true” gesetzt, werden nach einem Neustart von MongoDB die neuen Logeinträge falls möglich an ein bereits bestehendes Logfile angefügt.

source: (optional) Turns authentication on, if set to ``enabled``. It is advised to turn authentication on in case the MongoDB instance can be accessed over the network.
de: (optional) Aktiviert Authentifizierung. Dieser Parameter sollte unbedingt auf ``enabled`` gesetzt werden, falls es möglich ist, auf MongoDB über ein Netzwerk zuzugreifen. Dies hängt von Ihren Administrationseinstellungen/Firewalleinstellungen ab.

source: If you have installed MongoDB on Debian using a package manager, the default configuration file will probably contain the following entry: ::
de: Wenn Sie MongoDB auf Debian über einen Paketmanager installiert haben, wird die Standardkonfigurationsdatei wahrscheinlich den folgenden Eintrag enthalten: ::

source: This setting tells MongoDB to only bind to the local interface and reject remote connections. If you plan to install MongoDB and Tomcat on different machines, you must update this setting and either remove it or add the IP interface MongoDB should bind to, in order to listen for incoming connections. This value can contain a comma separated list of IPs and should NOT contain the IP address of the application server.
de: Diese Einstellung definiert für MongoDB sich nur an die lokale Netzwerkschnittstelle zu binden und Verbindungen von anderen Maschinen zu ignorieren. Wenn Sie vorhaben MongoDB und Tomcat auf verschiedenen Maschinen zu installieren, müssen Sie diese Einstellung anpassen und sie entweder entfernen oder die IP-Schnittstelle angeben, auf welche sich die MongoDB verbinden soll, um eingehende Verbindungen entgegen zu nehmen. Dieser Wert kann eine kommagetrennte Liste von IPs enthalten und sollte NICHT die IP des Anwendungsservers enthalten.

source: For more configuration options, see https://docs.mongodb.com/manual/reference/configuration-options/\ .
de: Weitere Konfigurationsoptionen können Sie entsprechend der folgenden Dokumentation setzen: https://docs.mongodb.com/manual/reference/configuration-options/\ .

source: Add a database user for Workflow Accelerator
de: Einen Datenbanknutzer für Workflow Accelerator hinzufügen

source: Workflow Accelerator requires a MongoDB user in the admin database that has the following roles:
de: Workflow Accelerator benötigt einen MongoDB-Nutzer, der in der Administrationsdatenbank die folgenden Rollen innehat:

source: This role will allow you to list all databases. This becomes necessary if you plan on using the user credentials when editing any database content with a tool like Robomongo. Furthermore, it is necessary for creating backups.
de: Diese Rolle erlaubt es, alle Datenbanken aufzuführen. Dies ist notwendig für Backups und falls ein Tool wie Robomongo für den Zugriff auf mehrere Datenbanken genutzt werden soll.

source: This role is required for backups.
de: Diese Rolle wird für Backups benötigt.

source: The user will access the databases for Workflow Accelerator. Workflow Accelerator will create two databases, one for the user and workflow data, and one for uploaded files. The name of the first database can be configured in the Workflow Accelerator configuration file. The name of the second database is derived from the name of the first one by adding “-files”. For instance, if you define the database name “signavio”, the databases “signavio” and “signavio-files” will be created.
de: Der Nutzer greift für Workflow Accelerator auf die Datenbank zu. Workflow Accelerator erstellt zwei Datenbanken, eine für Nutzer- und Workflow-Daten und eine Weitere für hochgeladene Dateien. Der Name der ersten Datenbank kann in der Workflow Accelerator-Konfigurationsdatei konfiguriert werden. Der zweite Name ist vom ersten Namen abgeleitet, indem die Endung „-files“ ergänzt wird. Nennen Sie Ihre erste Datenbank „signavio“, so heißt die zweite Datenbank „signavio-files“.

source: In general, if you want to create a new user in MongoDB you will need to authenticate with an existing user that has the role userAdmin or userAdminAnyDatabase. There is an exception for a fresh MongoDB set-up. It will allow you to create the first user from localhost without any authentication. The following examples will show you how to create a new user using the credentials of an admin user and how to do it without any credentials in case of a new MongoDB.
de: Wenn Sie einen neuen Nutzer In MongoDB erstellen wollen, müssen Sie sich mit einem Nutzer mit der Rolle userAdmin oder userAdminAnyDatabase in MongoDB anmelden. Eine Ausnahme stellt die Installation eines neuen MongoDB-Systems dar, dass Ihnen ermöglicht einen neuen Nutzer ohne vorherige Authentifizierung zu erstellen. Im Folgenden wird ein neuer MongoDB-Nutzer sowohl über einen Administratorennutzer als auch als Teil einer neuen MongoDB-Installation erstellt.

source: In order to add a new user to MongoDB, the MongoDB server has to be running. The following subsections will show you how to create the Workflow Accelerator database user using the command line.
de: Um einen MongoDB-Nutzer zu erstellen, muss MongoDB gestartet worden sein. Die folgenden Unterabschnitte beschreiben, wie Sie den Workflow Accelerator Datenbanknutzer mit Hilfe der Kommandozeile anlegen können.

source: Open the command line ``cmd`` and go to your MongoDB\bin directory, e.g. by executing: ``cd C:\MongoDB\bin``
de: Öffnen Sie in der Kommandozeile ``cmd`` das Verzeichnis MongoDB\bin, z.B. in dem Sie das folgende Kommando ausführen: ``cd C:\MongoDB\bin``

source: If you have an admin user, create the Workflow Accelerator user by executing:
de: Falls Sie einen Administratorennutzer angelegt haben, erstellen Sie den neuen Nutzer wie folgt:

source: Replace <enterAdminPasswordHere> with the password, you have defined for the admin user.
de: Ersetzen Sie <enterAdminPasswordHere> mit dem Administratorenpasswort.

source: Replace <enterSignavioPasswordHere> with the password for the new Workflow Accelerator user. As you can see the user name is signavio.
de: Ersetzen Sie <enterSignavioPasswordHere> mit dem Passwort des neuen Nutzers. Der Nutzername ist signavio.

source: If you have a new MongoDB and no admin user, create the Workflow Accelerator user by executing:
de: Falls Sie ein neues MongoDB System ohne Administratorennutzer aufgesetzt haben, führen Sie den folgenden Befehl aus:

source: You can verify the creation of the new Workflow Accelerator user by executing:
de: Um die Erstellung des Nutzers zu verifizieren, führen Sie den folgenden Befehl aus:

source: On the command line you will see the user information including the four assigned roles.
de: Die Kommandozeile wird den Nutzer und die vier assoziierten Rollen anzeigen.

source: If you have installed MongoDB using a package manager, the binaries should be available on the path. Otherwise, open the directory with the MongoDB binary files and follow the instructions.
de: Falls Sie MongoDB über einen Paketmanager installiert haben, werden die entsprechenden Anwendungen in die Linux-Standardpfade installiert weshalb sie ohne weitere Pfadangabe überall verfügbar sind. Öffnen Sie andernfalls einfach das Verzeichnis mit den Binaries, um dort die unten aufgeführten Befehle auszuführen.

source: Once the Workflow Accelerator user is created, its credentials have to be added to the Workflow Accelerator configuration file to the ``effektif.mongodb.username`` and ``effektif.mongodb.password`` properties. Section :ref:`update-effektif-configuration` explains how to update the configuration file.
de: Sobald der Workflow Accelerator-Nutzer erstellt wurde, müssen die Credentials in der Workflow Accelerator-Konfigurationsdatei unter der Variable ``effektif.mongodb.username`` und ``effektif.mongodb.password`` hinterlegt werden. Das Kapitel :ref:`update-effektif-configuration` beschreibt die Anpassung der Konfigurationsdatei.

source: Backup and restore
de: Backup und Wiederherstellung

source: You are advised to do regular backups of the MongoDB database to prevent a complete data loss in case of a system failure. The Workflow Accelerator system will NOT backup the user data on its own. The :ref:`backup` section explains in detail how to set up backups for MongoDB properly. The :ref:`restore` section explains how you can restore an older version of the user data from a backup.
de: Es wird Ihnen angeraten regelmäßige Backups der MongoDB Datenbank anzulegen um einen kompletten Datenverlust im Falle es Systemfehlers zu vermeiden. Das Workflow Accelerator System legt allein KEINE Backups der Nutzerdaten an. Kapitel :ref:`backup` beschreibt detailliert wie Sie Backups mit MongoDB anlegen können. In Kapitel :ref:`restore` wird Ihnen zusätzlich erklärt, wie Sie Backups verwenden um ältere Versionen der Nutzerdaten wieder herzustellen.

source: Installing Node.js
de: Node.js installieren

source: You only need to install and configure Node.js if you purchased a version of Workflow Accelerator which allows you to use JavaScript tasks.
de: Sie müssen Node.js nur installieren und konfigurieren, wenn Sie eine Version von Workflow Accelerator erworben haben, welche die Ausführung von JavaScript-Tasks ermöglicht.

source: Node.js is a runtime environment for JavaScript which is used by Workflow Accelerator to execute custom JavaScript tasks created by the user. We recommend using the Node.js LTS (Long Term Support) version 6.x.
de: Node.js ist eine Ausführungsumgebung für JavaScript, welche von Workflow Accelerator genutzt wird, um benutzerdefinierte JavaScript-Tasks auszuführen. Wir empfehlen Node.js LTS (Long Term Support) Version 6.x zu verwenden.

source: For Windows there is a comfortable installer to set up Node.js.
de: Unter Windows kann Node.js einfach per Installationsprogramm installiert werden.

source: Go to https://nodejs.org/en/download/
de: Öffnen Sie https://nodejs.org/en/download/

source: Select the LTS version.
de: Wählen Sie die LTS Version aus.

source: Download the *Windows Installer (.msi)* for your Windows version.
de: Laden Sie den *Windows Installer (.msi)* für Ihre Windows-Version herunter.

source: Execute the downloaded installer and follow installation guide.
de: Führen Sie das heruntergeladene Installationsprogramm aus und folgen Sie den Installationsanweisungen.

source: The Node.js site offers additional documentation for setting up Node.js on Debian using the package manager APT:
de: Die Node.js-Seite bietet zusätzliche Information für die Installation von Node.js unter Debian mit Hilfe des Paketmanagers APT an:

source: Please, make sure to install the LTS version of Node.js.
de: Bitte stellen Sie sicher, dass Sie die LTS-Version von Node.js installieren.

source: Installing the Workflow Accelerator Script Engine
de: Workflow Accelerator Script Engine installieren

source: You only need to install and configure the Script Engine if you purchased a version of Workflow Accelerator which allows you to use JavaScript tasks.
de: Sie müssen die Script Engine nur installieren und konfigurieren, wenn Sie eine Version von Workflow Accelerator erworben haben, welche die Ausführung von JavaScript-Tasks ermöglicht.

source: The Workflow Accelerator Script Engine uses Node.js to execute JavaScript tasks within a workflow and an embedded HTTP server to communicate with the Workflow Accelerator web application. You can either install the Script Engine on the same machine as the Workflow Accelerator web application or on a separate machine. However, if you use a separate machine to run the script engine, you have to make sure the web application can connect over HTTP to the configured port of the script engine and vice versa. In order to install the script engine, follow these instructions:
de: Die Workflow Accelerator Script Engine benutzt Node.js um JavaScript-Tasks innerhalb eines Workflows auszuführen, sowie einen eingebetteten HTTP Server um mit der Workflow Accelerator-Webanwendung zu kommunizieren. Sie können die Script Engine entweder auf der gleichen Maschine wie die Workflow Accelerator-Webanwendung installieren oder auf einer separaten Maschine. Insofern Sie eine separate Maschine benutzen, stellen Sie bitte sicher, dass die Webanwendung über HTTP auf den konfigurierten Port der Script Engine zugreifen kann und umgekehrt. Folgen Sie diesen Schritten, um die Script Engine zu installieren:

source: Create new local directory for the script engine, e.g. ``C:\Program Files\Script Engine`` or ``/var/lib/script-engine``.
de: Legen Sie ein neues lokales Verzeichnis für die Script Engine an, z.B. ``C:\Program Files\Script Engine`` oder ``/var/lib/script-engine``.

source: We will refer to this directory as ``$SCRIPT_ENGINE_HOME``.
de: Im folgenden wird dieses Verzeichnis als ``$SCRIPT_ENGINE_HOME`` referenziert.

source: Copy the content of the directory ``$WORKFLOW_HOME/script-engine/`` to your newly created directory.
de: Kopieren Sie den Inhalt des Verzeichnisses ``$WORKFLOW_HOME/script-engine/`` in Ihr neu angelegtes Verzeichnis.

source: You should find the file ``server.js`` directly within your directory: ``$SCRIPT_ENGINE_HOME/server.js``.
de: Die Datei ``server.js`` sollte sich direkt in Ihrem Verzeichnis befinden: ``$SCRIPT_ENGINE_HOME/server.js``.

source: Open ``$SCRIPT_ENGINE_HOME/configuration.onpremise.js`` and edit the values for the port, log files and Workflow Accelerator URL.
de: Öffnen Sie ``$SCRIPT_ENGINE_HOME/configuration.onpremise.js`` und passen Sie die Werte für den Port, die Log-Dateien und die Workflow Accelerator URL an.

source: Ensure that the port for the script engine is not used by any other application.
de: Stellen Sie sicher, dass der Port für die Script Engine nicht bereits von einer anderen Anwendung genutzt wird.

source: Add the URL of the script engine to the Workflow Accelerator configuration file, see :ref:`update-effektif-configuration` for more information.
de: Fügen Sie die URL der Script Engine zu der Workflow Accelerator-Konfigurationsdatei hinzu, vgl. :ref:`update-effektif-configuration` für weitere Informationen.

source: If you run the script engine on the same machine as the web application and use the default port the URL will be ``http://localhost:8081``.
de: Wenn Sie die Script Engine auf der gleichen Maschine ausführen wie die Webanwendung und den Standardport benutzen, dann lautet die URL ``http://localhost:8081``.

source: The configuration file offers the following options:
de: Die Konfigurationsdatei bietet die folgenden Optionen:

source: Defines the port the script engine will bind to and listen for incoming HTTP requests.
de: Legt den Port fest, an den sich die Script Engine bindet und auf eingehende HTTP Anfragen wartet.

source: Defines the URL of the Workflow Accelerator system (including port), e.g. ``http://localhost:8080``
de: Legt die URL fest, unter welcher das Workflow Accelerator System erreichbar ist (inklusive Port), z.B. ``http://localhost:8080``.
