Repository: effektif/admin-docs
Catalog: docs/_locale/*/LC_MESSAGES/optional.po
Languages: de

source: Optional configuration
de: Optionale Konfiguration

source: This section provides instructions for optional configuration, which is not required for all installations.
de: In diesem Abschnitt werden optionale Konfigurationsmöglichkeiten beschrieben, die nicht für alle Installationen erforderlich sind.

source: User and group synchronisation with Active Directory
de: Nutzer- und Gruppensynchronisation mit Active Directory

source: The enterprise version of Signavio Workflow offers user and group synchronisation with an Active Directory Server using the LDAP V3 protocol.
de: Die Enterprise-Version von Signavio Workflow bietet die Nutzer- und Gruppensynchronisationen mit einem Active Directory Server unter der Verwendung des LDAP V3 Protokolls.

source: Before you can configure the synchronisation, check that you have the following pre-requisites.
de: Bevor Sie mit der Konfiguration für die Synchronisation beginnen, überprüfen Sie ob die folgende Vorbedingungen erfüllt sind.

source: Signavio Workflow is installed.
de: Signavio Workflow ist installiert.

source: The first Signavio Workflow user is registered, see :ref:`create-initial-user`\ .
de: Der erste Signavio Workflow-Nutzer wurde registriert, vgl. :ref:`create-initial-user`\ .

source: A domain account for querying the Active Directory - its username and password.
de: Ein Domänenkonto um Anfragen an das Active Directory zu stellen - Nutzername und Passwort

source: Configuring the synchronisation consists of the following steps.
de: Die Konfiguration der Synchronisation umfasst die folgenden Schritte.

source: Create an Active Directory group that contains all Signavio Workflow users as members.
de: Legen Sie eine Active Directory-Gruppe an, welche alle Signavio Workflow-Nutzer als Mitglieder enthält.

source: Create an Active Directory group that contains all Signavio Workflow administrators as members.
de: Legen Sie eine Active Directory-Gruppe an, welche alle Signavio Workflow-Administratoren als Mitglieder enthält.

source: (Optional) Create an Active Directory group that contains all groups as members.
de: (Optional) Legen Sie eine Active Directory-Gruppe an, welche alle Gruppen als Mitglieder enthält.

source: Log in to Signavio Workflow with your initial user.
de: Loggen Sie sich in Signavio Workflow mit dem initialen Nutzer ein.

source: Open the *Organization settings* and select the *LDAP* tab.
de: Öffnen Sie die *Organisationseinstellungen* and wählen Sie den Tab *LDAP* aus.

source: Create a new Active Directory configuration.
de: Erstellen Sie eine neue Active Directory-Konfiguration.

source: Validate your configuration.
de: Validieren Sie Ihre Konfiguration.

source: Synchronise the users and groups.
de: Synchronisieren Sie die Nutzer und Gruppen.

source: Creating the Active Directory groups
de: Active Directory-Gruppen erstellen

source: Active Directory users and groups that should be synchronised with Signavio Workflow are managed within Active Directory by adding them to specific Active Directory groups. There are two groups for users, one which contains all Signavio Workflow users and one which contains only administrators. All members of the administrator group must be members of the user group as well. Nested groups are not supported. All users and administrators need to be direct members of their groups.
de: Active Directory-Nutzer und Gruppen, die mit Signavio Workflow synchronisiert werden sollen, werden innerhalb des Active Directory verwaltet, in dem sie zu speziellen Active Directory-Gruppen hinzugefügt werden. Es gibt zwei Gruppen für Nutzer. Die Erste enthält alle Signavio Workflow-Nutzer. Die zweite Gruppe enthält nur die Administratoren. Alle Mitglieder der Administratorengruppe müssen auch Mitglieder der Nutzergruppe sein. Geschachtelte Gruppen werden nicht unterstützt. Alle Nutzer und Administratoren müssen direkte Mitglieder Ihrer Gruppen sein.

source: The synchronisation will copy the attributes ``givenName``, ``sn``, ``mail``, ``dn``, ``objectGUID``, ``sAMAccountName`` and ``userPrincipalName``\ to the user in Signavio Workflow. It is required that every user has the ``mail`` attribute defined.
de: Die Synchronisation wird die Attribute ``givenName``, ``sn``, ``mail``, ``dn``, ``objectGUID``, ``sAMAccountName`` und ``userPrincipalName``\ zu dem Nutzer in Signavio Workflow kopieren. Jeder Nutzer muss das Attribut ``mail`` definiert haben.

source: Optionally, you can define a third group that contains all Active Directory groups that should be synchronised. All members of this group should be Active Directory groups as well. Again nested groups are not supported. Users must be direct members of the synchronised groups. The synchronisation will copy the attributes ``cn``, ``dn`` and ``objectGUID`` to the group in Signavio Workflow. Every group member that is not a Signavio Workflow user will be ignored.
de: Optional können Sie eine dritte Gruppe definieren, welche alle Active Directory-Gruppen enthält, die synchronisiert werden sollen. Alle Mitglieder dieser Gruppe sollten Active Directory-Gruppen sein. Auch hier werden geschachtelte Gruppen nicht unterstützt. Nutzer müssen direkte Mitglieder der synchronisierten Gruppen sein. Die Synchronisation wird die Attribute ``cn``, ``dn`` und ``objectGUID`` zu der Gruppe in Signavio Workflow kopieren. Jedes Gruppenmitglied, das kein Nutzer in Signavio Workflow ist, wird ignoriert.

source: Creating a new configuration
de: Eine neue Konfiguration erstellen

source: In the LDAP configuration tab, select *Create* to start the configuration. Enter the configuration details on the configuration form.
de: Im Tab LDAP, wählen Sie *Erstellen* um mit der Konfiguration zu beginnen. Fügen Sie dann die entsprechenden Konfigurationsdetails in das Formular ein.

source: *URL* - the location of your Active Directory server, e.g. ``ldap://adtest.local:389``\
de: *URL* - die Adresse des Active Directory Servers, z.B. ``ldap://adtest.local:389``\

source: *username* and *password* - the login credentials of the domain account
de: *Nutzername* und *Passwort* - die Zugangsdaten des Domänenkontos

source: *User group DN* - the distinguished name (DN) of the Active Directory group which contains all users
de: *DN der Nutzergruppe* - der Distinguished Name (DN) der Active Directory-Gruppe, die alle Nutzer enthält

source: *Admin group DN* - the DN of the Active Directory group which contains all administrators
de: *DN der Administratorengruppe* - der Distinguished Name (DN) der Active Directory-Gruppe, die alle Administratoren enthält

source: *Group group DN* - (optional) the DN of the Active Directory group which contains all groups
de: *DN der Gruppe der Gruppen* - der Distinguished Name (DN) der Active Directory-Gruppe, die alle Gruppen enthält

source: *License* - the license that will be assigned to every synchronised user
de: *Lizenz* - die Lizenz, die jedem synchronisierten Nutzer zugewiesen wird

source: The last field of the configuration form will show you if the configuration was already validated.
de: Das letzte Feld des Konfigurationsformulars zeigt Ihnen an, ob die Konfiguration bereits validiert wurde.

source: Validating a configuration
de: Konfiguration validieren

source: Before synchronisation can start, the configuration must be validated. Validation includes the following checks.
de: Bevor die Synchronisation ausgeführt werden kann, muss die Konfiguration validiert werden. Die Validierung umfasst die folgenden Kontrollen.

source: Signavio Workflow can connect to the Active Directory.
de: Signavio Workflow kann sich mit dem Active Directory verbinden.

source: The configured groups are proper Active Directory groups.
de: Die konfigurierten Gruppen sind korrekte Active Directory-Gruppen

source: There is at least one user.
de: Es gibt wenigstens einen Nutzer.

source: There is at least one administrator.
de: Es wenigstens einen Administrator.

source: The users have the ``mail`` attribute defined.
de: Für die Nutzer ist das Attribute ``mail`` definiert.

source: There are sufficient licenses.
de: Es gibt genügend Lizenzen.

source: (Optional) There are groups defined.
de: (Optional) Die Gruppen sind festgelegt.

source: Start the validation by selecting *Validate*. If the configuration is valid, the *Synchronise* button is enabled. If the configuration is not valid, the page shows a list with more detailed information. In that case fix the issues and run the validation again.
de: Starten Sie die Validierung, in dem Sie *Validieren* auswählen. Sobald die Konfiguration gültig ist, wird der Knopf *Synchronisieren* aktiviert. Wenn die Konfiguration ungültig ist, zeigt Ihnen die Seite eine Liste mit detaillierten Informationen an. In diesem Fall, beheben Sie die Probleme führen Sie die Validierung erneut aus.

source: Every time you change the configuration, the validation must be executed again.
de: Jede Änderung der Konfiguration erfordert, dass die Validierung erneut ausgeführt werden muss.

source: Note the validation might take several seconds depending on the number of users you want to synchronise and the perfomance of the Active Directory server.
de: Beachten Sie, die Validierung kann einige Sekunden in Anspruch nehmen, abhängig von der Anzahl der Nutzer, die Sie synchronisieren möchten und der Performance Ihres Active Directory Servers.

source: Synchronising users and groups
de: Nutzer und Gruppen synchronisieren

source: If the configuration is valid, you can synchronise the users and groups. Start the synchronisation by clicking on *Synchronise*. If the synchronisation was successful, you will see a report of the added / updated users and groups. If the synchronisation failed, a list with more detailed information will be shown.
de: Nutzer und Gruppen können synchronisiert werden, sobald die Konfiguration gültig ist. Starten Sie die Synchronisation, in dem Sie auf *Synchronisieren* klicken. Wenn die Synchronisation erfolgreich war, sehen Sie einen Bericht über die hinzugefügten / aktualisierten Nutzer und Gruppen. Wenn die Synchronisation nicht erfolgreich war, sehen Sie eine Liste mit detaillierteren Informationen.

source: Note the synchronisation might take several seconds or minutes depending on the number of users you want to synchronise and the perfomance of the Active Directory.
de: Beachten Sie, die Synchronisation kann einige Sekunden oder Minuten in Anspruch nehmen, abhängig von der Anzahl der Nutzer, die Sie synchronisieren möchten und der Performance Ihres Active Directory Servers.

source: Single Sign-On using Windows and Kerberos/SPNEGO
de: Single Sign-On mit Windows und Kerberos/SPNEGO

source: Use this configuration to enable Single Sign-On (SSO) in a Windows environment that supports user authentication using `Kerberos <https://en.wikipedia.org/wiki/Kerberos_%28protocol%29>`_ and `SPNEGO <https://en.wikipedia.org/wiki/SPNEGO>`_.
de: Benutzen Sie diese Konfiguration um Single Sign-On (SSO) in einer Windows-Umgebung zu aktivieren, die eine Authentifizierung über `Kerberos <https://en.wikipedia.org/wiki/Kerberos_%28protocol%29>`_ und `SPNEGO <https://en.wikipedia.org/wiki/SPNEGO>`_ unterstützt.

source: Before you start, check that you have the following pre-requisites.
de: Bevor Sie beginnen, stellen Sie sicher, dass folgende Vorbedingungen erfüllt sind.

source: Windows domain users added to Signavio Workflow, e.g. using LDAP synchronisation.
de: Windows Domänennutzer wurden zu Signavio Workflow hinzugefügt, z.B. mit der LDAP Synchronisation

source: A Windows domain for authenticating users.
de: Ein Windows Domänenkonto um die Nutzer zu authentifizieren.

source: A domain account for running Signavio Workflow - its username and password.
de: Ein Domänenkonto um Signavio Workflow auszuführen - Nutzername und Passwort

source: Signavio Workflow is installed on a Windows Server that is on the domain.
de: Signavio Workflow ist auf einem Windows Server installiert, der sich in der Domäne befindet.

source: Configuring SSO in Apache Tomcat consists of the following steps.
de: Die Konfiguration von SSO im Apache Tomcat umfasst folgende Schritte.

source: Install the SPNEGO library’s JAR file.
de: Installieren Sie die JAR-Datei der SPNEGO Bibliothek.

source: Configure the SPNEGO SSO Servlet filter.
de: Konfigurieren Sie den SPNEGO SSO Servlet Filter.

source: Add the ``krb5.conf`` and ``login.conf`` configuration files to ``$TOMCAT_HOME/``.
de: Fügen Sie die Konfigurationsdateien ``krb5.conf`` und ``login.conf`` zu dem Verzeichnis ``$TOMCAT_HOME/`` hinzu.

source: Register Tomcat’s Service Principal Name (SPN)
de: Registrieren Sie Tomcat's Service Principal Name (SPN)

source: Configure Tomcat to be executed with a domain account.
de: Konfigurieren Sie, dass Tomcat mit einem Domänenkonto ausgeführt wird.

source: Restart Tomcat.
de: Starten Sie Tomcat neu.

source: Install the SPNEGO library
de: SPNEGO Bibliothek installieren

source: The SPNEGO library makes it possible to authenticate users by connecting to an Active Directory server.
de: Die SPNEGO Bibliothek ermöglicht die Authentifizierung von Nutzern durch ein Verbindung zu einem Active Directory Server.

source: To install, copy two files to ``$TOMCAT_HOME/lib/``:
de: Für die Installation kopieren Sie die zwei Dateien in das Verzeichnis ``$TOMCAT_HOME/lib/``:

source: Configuring the SPNEGO SSO Servlet filter
de: SPNEGO SSO Servlet Filter konfigurieren

source: The SSO Servlet filter uses Windows authentication to automatically log in when a user accesses Signavio Workflow.
de: Der SSO Servlet Filter nutzt die Windows-Authentifizierung um Nutzer automatisch einzuloggen sobald sie auf Signavio Workflow zugreifen.

source: To configure, edit ``$TOMCAT_HOME/conf/web.xml`` and add the following lines immediately before the final line (``</web-app>``), from ``$WORKFLOW_HOME/optional/spnego/filter-configuration.xml``.
de: Für die Konfiguration passen Sie die ``$TOMCAT_HOME/conf/web.xml`` an. Kopieren Sie den Inhalt von ``$WORKFLOW_HOME/optional/spnego/filter-configuration.xml`` und fügen Sie Ihn direkt vor der letzten Zeile (``</web-app>``) hinzu.

source: Near the bottom, replace two occurrences of ``???`` with the domain account’s username and password, respectively.
de: Ersetzen Sie die zwei Vorkommnisse von ``???`` nahe des Endes mit dem entsprechenden Nutzernamen und Passwort des Domänenkontos.

source: Adding SPNEGO configuration files
de: SPNEGO Konfigurationsdateien hinzufügen

source: Copy ``krb5.conf`` to ``$TOMCAT_HOME/``, and edit the file:
de: Kopieren Sie ``krb5.conf`` in das Verzeichnis ``$TOMCAT_HOME/`` und passen Sie die Datei an:

source: replace five occurrences of ``ADTEST`` with the Windows domain name
de: Ersetzen Sie alle Vorkommnisse von ``ADTEST`` mit dem Namen Ihrer Windows-Domäne.

source: replace ``123.45.6.7`` with the host name or IP address of the Active Directory server.
de: Ersetzen Sie ``123.45.6.7`` mit dem Hostnamen oder der IP-Adresse des Active Directory Servers.

source: Copy ``login.conf`` to ``$TOMCAT_HOME/``.
de: Kopieren Sie ``login.conf`` in das Verzeichnis ``$TOMCAT_HOME/``.

source: Registering Tomcat’s Service Principal Name (SPN)
de: Tomcat's Service Principal Name (SPN) registrieren

source: The `SPN <https://msdn.microsoft.com/en-us/library/ms677949(v=vs.85).aspx>`_ is the identifier used by Kerberos authentication to associate a service instance with a service logon account. You will have to associate the domain account for Signavio Workflow with the service’s fully-qualified domain name (FQDN). Therefore, you should register a SPN for every possible alias of the service, including the computer name of the server with and without domain name, as well as any other DNS entries that point to this server. In order to define a SPN, use ``setspn.exe`` - part of the `Windows Support Tools <https://en.wikipedia.org/wiki/Windows_Support_Tools>`_\ .
de: Der `SPN <https://msdn.microsoft.com/en-us/library/ms677949(v=vs.85).aspx>`_ ist der Bezeichner, der von der Kerberos-Authentifizierung genutzt wird, um eine Service-Instanz mit einem Service-Domänenkonto zu verknüpfen. Hierfür müssen Sie das Domänenkonto von Signavio Workflow mit dem Fully-Qualified Domain Name (FQDN) des Service verbinden. Sie sollten einen SPN für jeden möglichen Alias des Service anlegen. Dies umfasst den Namen des Servers mit und ohne Domänennamen, sowie alle DNS-Einträge, die auf den Server verweisen. Um einen SPN anzulegen, verwenden Sie ``setspn.exe`` - Teil der `Windows Support Tools <https://en.wikipedia.org/wiki/Windows_Support_Tools>`_\ .

source: For example, our domain is called ``ADTEST.LOCAL``, the computer name of the server is ``VM-42``, Signavio Workflow will be available under the domain ``http://workflow.intranet:8080`` and the domain user account is ``tomcat@adtest.local``\ . Then we would have to register the following SPNs:
de: In unserem Beispiel heißt die Domäne ``ADTEST.LOCAL``, der Computername des Servers lautet ``VM-42``, Signavio Workflow ist unter der Adresse ``http://workflow.intranet:8080`` verfügbar und das Domänenkonto heißt ``tomcat@adtest.local``\ . Daraus ergeben sich die folgenden SPNs:

source: For more information see the `Microsoft documentation <https://msdn.microsoft.com/en-us/library/cc281382.aspx>`_\ .
de: Weitere Information finden Sie in der `Microsoft Dokumentation <https://msdn.microsoft.com/en-us/library/cc281382.aspx>`_\ .

source: You can list all registered SPNs which are associated to a domain account with the following command:
de: Mit dem folgenden Befehl können Sie alle registrierten SPNs, die mit einem Domänenkonto verknüpft sind, auflisten:

source: Configuring the Tomcat user
de: Tomcat-Nutzer konfigurieren

source: By default the Tomcat application server is executed with a local system account. The SSO setup requires the Tomcat to be executed with a domain account. You should use the same domain account which you already configured in :ref:`configure-sso-filter`\ .
de: Standardmäßig wird der Tomcat Server mit einem lokalen Systemkonto ausgeführt. Für das SSO Setup ist es jedoch erforderlich Tomcat mit einem Domänenkonto auszuführen. Sie sollten das gleiche Domänenkonto verwenden, dass Sie bereits in :ref:`configure-sso-filter` konfiguriert haben.

source: Open the Windows services dialogue ``services.msc``
de: Öffnen Sie den Dialog für Windows-Dienste ``services.msc``\ .

source: Select your Apache Tomcat service and open the properties
de: Wählen Sie den Apache Tomcat Service aus und öffnen Sie die Eigenschaften.

source: Select the *Log On* tab
de: Wählen Sie den Tab *Anmelden* aus.

source: Choose the option *This account* and fill in the domain account credentials
de: Wählen Sie die Option *Dieses Konto* und tragen Sie die Zugangsdaten des Domänenkontos ein.

source: First follow the steps in the `SPNEGO Pre-flight checklist <http://spnego.sourceforge.net/pre_flight.html>`_. Run the ``HelloKDC`` connection test in the ``$TOMCAT_HOME/`` directory to use the ``krb5.conf`` and ``login.conf`` you configured above.
de: Folgen Sie zuerst den Anweisungen in der `SPNEGO Pre-flight Checkliste <http://spnego.sourceforge.net/pre_flight.html>`_. Führen Sie den ``HelloKDC`` Verbindungstest im Verzeichnis ``$TOMCAT_HOME/`` aus und benutzen Sie dafür die Dateien ``krb5.conf`` und ``login.conf``, die Sie zuvor konfiguriert haben.

source: Note that in the `Pre-flight checklist`, the `Do we know the address of the KDC?` section recommends using the KDC host name instead of the IP address.
de: Beachten Sie, in der `Pre-flight Checkliste`, der Absatz `Do we know the address of the KDC?` empfiehlt den Hostnamen des KDC zu verwenden statt der IP-Adresse.

source: If you have completed the setup described here and the SSO is still not working, please make sure you are accessing the web application from a different machine than the one that runs the Tomcat server. Furthermore, check if `Integrated Windows Authentication <https://en.wikipedia.org/wiki/Integrated_Windows_Authentication>`_ is activated and the Signavio Workflow system is a trusted service, for instance by adding the address to the local intranet.
de: Wenn Sie das hier beschriebene Setup vollständig durchlaufen haben und SSO trotzdem noch nicht funktioniert, stellen Sie bitte sicher, dass Sie von einem gesonderten Rechner auf die Webanwendung zugreifen und nicht direkt von dem Rechner, der den Tomcat Server ausführt. Stellen Sie weiterhin sicher, dass die `Integrierte Windows-Authentifizierung <https://en.wikipedia.org/wiki/Integrated_Windows_Authentication>`_ aktiviert ist und Signavio Workflow zu den vertrauenswürdigen Diensten gehört, z.B. in dem Sie die Adresse zum lokalen Intranet hinzufügen.

source: If you see an error page with the following error message:
de: Wenn Sie eine Fehlerseite mit dem folgenden Fehler sehen:

source: The time difference between the computer accessing Signavio Workflow and the Kerberos server is bigger than 5 minutes. You will need to synchronise the time on all machines, e.g. by running ntp to fix the issue.
de: Der Zeitunterschied zwischen dem Computer, der auf Signavio Workflow zugreift und dem Kerberos Server ist größer als fünf Minuten. Sie müssen die Zeit zwischen allen Maschinen synchronisieren, z.B. in dem Sie ntp ausführen.

source: Additionally, you can check the log files in ``$TOMCAT_HOME/logs`` for further error messages. These error messages may offer hints about why the SSO set-up is failing.
de: Zusätzlich können Sie auch die Log-Dateien im Verzeichnis ``$TOMCAT_HOME/logs`` auf Fehlernachrichten überprüfen. Diese Fehlernachrichten können weitere Hinweise enthalten, warum Ihr SSO Setup nicht funktioniert.

source: If the log files contain the error message ``Request header is too large``, the size of the Kerberos tickets issued by your KDC and sent in the request header are too large for the default Tomcat settings. You have to set the ``maxHttpHeaderSize`` option in the Tomcat ``server.xml``.
de: Wenn die Log-Dateien die Fehlernachricht ``Request header is too large`` enthalten, dann sind die Kerberos-Tickets, die von Ihrem KDC ausgegeben und im Anfrage-Header versendet werden, zu groß für die Tomcat-Standardeinstellungen. Sie müssen zusätzlich die Option ``maxHttpHeaderSize`` in der Tomcat ``server.xml`` setzen.

source: Open ``$TOMCAT_HOME/conf/server.xml``
de: Öffnen Sie ``$TOMCAT_HOME/conf/server.xml``

source: Locate the ``Connector`` configuration in the file
de: Finden Sie den Konfigurationseintrag ``Connector`` in der Datei

source: Add the value ``maxHttpHeaderSize="65536"`` ::
de: Fügen Sie den Wert ``maxHttpHeaderSize="65536"`` hinzu ::

source: Save the file and restart Tomcat
de: Speichern Sie die Datei und starten Sie den Tomcat neu
