Repository: effektif/admin-docs
Catalog: docs/_locale/*/LC_MESSAGES/update.po
Languages: de

source: Updating Signavio Workflow Accelerator
de: Signavio Workflow Accelerator aktualisieren

source: This section will guide you through an update of your Workflow Accelerator system. It assumes you have successfully installed an early version of Workflow Accelerator. If you are installing Workflow Accelerator for the first time, you can skip this chapter.
de: Dieses Kapitel wird Sie schrittweise durch eine Aktualisierung Ihres Workflow Accelerator-Systems führen. Hierbei wird angenommen, dass Sie bereits eine ältere Version von Workflow Accelerator erfolgreich installiert haben. Wenn Sie Workflow Accelerator zum ersten Mal installieren, können Sie dieses Kapitel überspringen.

source: First, check :ref:`update-notes` for additional information about the update to the latest version of Workflow Accelerator before continuing.
de: Überprüfen Sie bitte zuerst ob :ref:`update-notes` weitere Hinweise zur Aktualisierung von Workflow Accelerator auf die neueste Version enthält, bevor Sie weiterlesen.

source: Unpack Signavio Workflow Accelerator
de: Signavio Workflow Accelerator entpacken

source: Unzip the signavio-workflow-{version}.zip to a directory of your choice, e.g. ``/yourlocation/signavio-workflow-{version}`` In the rest of this guide, we'll refer to the Workflow Accelerator home directory as ``$WORKFLOW_HOME``\ . The directory will contain the following files:
de: Entpacken Sie das Archiv signavio-workflow-{version}.zip in einem Verzeichnis Ihrer Wahl, zum Beispiel: ``/yourlocation/signavio-workflow-{version}`` Dieses Verzeichnis wird im weiteren Text als ``$WORKFLOW_HOME`` bezeichnet. Das Verzeichnis enthält die folgenden Dateien:

source: \*.sh - Linux shell scripts
de: \*.sh - Linux Shellskripte

source: db - directory that contains MongoDB configuration files
de: db – Verzeichnis, das die MongoDB Konfigurationsdateien enthält

source: mongod.conf - configuration file for Linux
de: mongod.conf – Konfigurationsdateien für Linux

source: mongod.cfg - configuration file for Windows
de: mongod.cfg - Konfigurationsdateien für Windows

source: mail-relay - directory that contains the mail relay
de: mail-relay – Verzeichnis, das das Mail Relay enthält

source: script-engine - directory that contains the script engine
de: script-engine - Verzeichnis, das die Dateien der Script Engine enthält

source: optional - directory that contains optional resources
de: optional – Verzeichnis, das optional Ressourcen enthält

source: spnego - directory that contains resources to setup SSO with SPNEGO
de: spnego - Verzeichnis, das die Dateien enthält um SSO mit SPNEGO aufzusetzen

source: webapps - directory
de: webapps - Verzeichnis

source: ROOT - this directory contains the web application
de: ROOT - Verzeichnis, das die Webanwendung enthält

source: On Linux systems you need to make the scripts executable with the ``chmod`` command like this: ::
de: Auf Linux-Systemen ist es notwendig, die Shell-Skripte ausführbar zu machen. Verwenden Sie hierfür den ``chmod``\ -Befehl, wie zum Beispiel: ::

source: Stop Workflow Accelerator
de: Workflow Accelerator stoppen

source: Before you can start with the update process you have to shutdown the Workflow Accelerator system. It is sufficient when you shutdown the Tomcat server Workflow Accelerator is running on. You don't have to shutdown the MongoDB server. If you installed the Workflow Accelerator Script Engine, you need to stop it as well. Refer to chapter :ref:`stopping` for information on how to stop Workflow Accelerator.
de: Bevor Sie mit der Aktualisierung des Workflow Accelerator-Systems starten können, müssen Sie zunächst das Workflow Accelerator-System herunterfahren. Es reicht aus, wenn Sie hierfür den Tomcat Server beenden, in welchem Workflow Accelerator ausgeführt wird. Den MongoDB Server müssen Sie für die Aktualisierung nicht beenden. Insofern Sie die Workflow Accelerator Script Engine installiert haben, müssen Sie diese auch stoppen. In Kapitel :ref:`stopping` finden Sie weitere Information darüber, wie Sie Workflow Accelerator stoppen.

source: Updating Workflow Accelerator to a newer version might involve changes in the database schema. Therefore, you are requested to backup the database before you go on. See chapter :ref:`backup` for more information on how to create a backup. Furthermore, the backup is necessary in case you have to revert Workflow Accelerator to an older version, because changes of the database schema are in general not backward compatible. This means you cannot run an older version of Workflow Accelerator with a database that was already migrated to a newer version.
de: Während der Aktualisierung von Workflow Accelerator auf eine neuere Version kann es vorkommen, dass das Datenbankschema angepasst werden muss. Dementsprechend sollten Sie ein Backup der Datenbank anlegen, bevor Sie mit der Aktualisierung fortfahren. In Kapitel :ref:`backup` finden Sie mehr Informationen, wie Sie ein Backup mit MongoDB anlegen. Weiterhin ist das Backup notwendig für den Fall, dass Sie eine ältere Version von Workflow Accelerator wieder herstellen müssen, denn ein verändertes Datenbankschema ist im Allgemeinen nicht abwärtskompatibel. Das bedeutet, dass Sie keine ältere Version von Workflow Accelerator mit einer Datenbank betreiben können, die bereits auf ein neueres Schema migriert wurde.

source: Backup the configuration files
de: Sichern der Konfigurationsdateien

source: During the first setup you have modified some configuration files and added the Workflow Accelerator license file. In order to preserve those changes, you have to copy those files to another location before updating the Workflow Accelerator system. You can find those files in the directory ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .
de: Während der initialen Installation haben Sie einige Konfigurationsdateien bearbeitet und die Workflow Accelerator-Lizenzdatei installiert. Um diese Änderungen nicht zu verlieren, müssen die entsprechenden Konfigurationsdateien sichern und dafür an eine andere Stelle kopieren bevor Sie das Workflow Accelerator-System aktualisieren. Sie finden die entsprechenden Dateien in dem Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .

source: Workflow Accelerator configuration file
de: Workflow Accelerator-Konfigurationsdatei

source: configuration file for Workflow Accelerator logs
de: Konfiguration der Workflow Accelerator-Logs

source: Workflow Accelerator license file
de: Workflow Accelerator-Lizenzdatei

source: Simply copy the files mentioned above to another location, e.g. ``$TOMCAT_HOME/webapps``\ .
de: Kopieren Sie einfach die oben genannten Dateien in ein anderes Verzeichnis, z. B. ``$TOMCAT_HOME/webapps``\ .

source: If you installed the Workflow Accelerator Script Engine, you modified the configuration file ``configuration.onpremise.js`` of the script engine as well. You can find the configuration file directly within the ``$SCRIPT_ENGINE_HOME`` directory. Please copy it as well to another location before you go on.
de: Wenn Sie die Workflow Accelerator Script Engine installiert haben, dann haben Sie auch die Konfigurationsdatei der Script Engine ``configuration.onpremise.js`` angepasst. Sie finden die Konfigurationsdatei in dem Verzeichnis ``$SCRIPT_ENGINE_HOME``\ . Bitte kopieren Sie diese Datei auch an eine andere Stelle, bevor Sie fort fahren.

source: Install a new version
de: Eine neue Version installieren

source: In order to update the Workflow Accelerator system, you have to replace the ``ROOT`` folder in ``$TOMCAT_HOME/webapps`` with the newer version you can find in the extracted directory ``$WORKFLOW_HOME/webapps``\ .
de: Um das Workflow Accelerator-System zu aktualisieren, müssen Sie den Ordner ``ROOT`` im Verzeichnis ``$TOMCAT_HOME/webapps`` durch die neuere Version ersetzen, welche sich in dem entpackten Verzeichnis ``$WORKFLOW_HOME/webapps`` befindet.

source: Delete the directory ``$TOMCAT_HOME/webapps/ROOT`` completely.
de: Löschen Sie den Ordner ``$TOMCAT_HOME/webapps/ROOT`` vollständig.

source: Copy the directory ``$WORKFLOW_HOME/webapps/ROOT`` to ``$TOMCAT_HOME/webapps``\ .
de: Kopieren Sie den Ordner ``$WORKFLOW_HOME/webapps/ROOT`` nach ``$TOMCAT_HOME/webapps``\ .

source: Copy the configuration files you have backed up in subsection :ref:`update-backup-configuration` back into the directory ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .
de: Kopieren Sie die Konfigurationsdateien, die Sie in Abschnitt :ref:`update-backup-configuration` gesichert haben, zurück in das Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .

source: If you have been provided with a new ``license.xml``\ , copy the file into ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes`` and replace the existing file. Otherwise, you can keep on using the old ``license.xml``\ .
de: Insofern Sie mit der Aktualisierung eine neue ``license.xml`` erhalten haben, kopieren Sie diese Datei in das Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes`` und ersetzen die bestehende Datei. Sollten Sie keine neue ``license.xml`` erhalten haben, können Sie weiterhin die alte Datei verwenden.

source: If you have installed the Workflow Accelerator Script Engine, you need to update the content of the ``$SCRIPT_ENGINE_HOME`` directory with the newer version you can find in the extracted directory ``$WORKFLOW_HOME/script-engine``\ .
de: Wenn Sie die Workflow Accelerator Script Engine installiert haben, müssen Sie den Inhalt des Verzeichnis ``$SCRIPT_ENGINE_HOME`` durch die neuere Version in dem Verzeichnis ``$WORKFLOW_HOME/script-engine`` ersetzen.

source: Delete all files in the directory ``$SCRIPT_ENGINE_HOME``.
de: Löschen Sie alle Dateien im Verzeichnis ``$SCRIPT_ENGINE_HOME``.

source: Copy the content of the directory ``$WORKFLOW_HOME/script-engine`` to your ``$SCRIPT_ENGINE_HOME`` directory.
de: Kopieren Sie den Inhalt des Verzeichnisses ``$WORKFLOW_HOME/script-engine`` in Ihr ``$SCRIPT_ENGINE_HOME`` Verzeichnis.

source: Copy the configuration file ``configuration.onpremise.js`` you have backed up in subsection :ref:`update-backup-configuration` back into the directory ``$SCRIPT_ENGINE_HOME``.
de: Kopieren Sie die Konfigurationsdatei ``configuration.onpremise.js``, die Sie in Abschnitt :ref:`update-backup-configuration` gesichert haben, zurück in das Verzeichnis ``$SCRIPT_ENGINE_HOME``\ .

source: If you have installed the Workflow Accelerator Mail Relay, you need to update the content of the ``mail-relay.jar`` file within the ``$MAIL_RELAY_HOME`` directory with the newer version you can find in the extracted directory ``$WORKFLOW_HOME/mail-relay``\ .
de: Wenn Sie das Workflow Accelerator Mail Relay installiert haben, dann müssen Sie die Datei ``mail-relay.jar`` im Verzeichnis ``$MAIL_RELAY_HOME`` durch die neuere Version ersetzen, die Sie im extrahierten Verzeichnis ``$WORKFLOW_HOME/mail-relay`` finden.

source: Delete the file ``$MAIL_RELAY_HOME/mail-relay.jar``
de: Löschen Sie die Datei ``$MAIL_RELAY_HOME/mail-relay.jar``

source: Copy the file ``$WORKFLOW_HOME/mail-relay/mail-relay.jar`` to your ``$MAIL_RELAY_HOME`` directory.
de: Kopieren Sie die Datei ``$WORKFLOW_HOME/mail-relay/mail-relay.jar`` in Ihr Verzeichnis ``$MAIL_RELAY_HOME``.

source: Revisit the configuration files
de: Konfigurationsdateien anpassen

source: After upgrading to a newer version, it might be necessary to update existing configuration files and add, remove, or modify some values. Refer to section :ref:`configure-effektif` and make sure your Workflow Accelerator configuration file is up-to-date before starting the system again.
de: Wenn das System auf eine neuere Version gebracht wird, kann es notwendig sein, die existierenden Konfigurationsdateien erneut anzupassen und entsprechende Werte hinzuzufügen, anzupassen oder zu entfernen. Konsultieren Sie hierfür erneut Abschnitt :ref:`configure-effektif` und stellen Sie sicher, dass Ihre Workflow Accelerator-Konfiguration auf dem neuesten Stand ist bevor Sie das System wieder hochfahren.

source: Start Workflow Accelerator
de: Workflow Accelerator starten

source: When you have successfully installed the new Workflow Accelerator version and verified that the configuration files are up-to-date, you can restart the Workflow Accelerator system. Refer to chapter :ref:`starting-effektif` for more information on how to start Workflow Accelerator.
de: Sobald Sie die neue Version von Workflow Accelerator erfolgreich installiert und sichergestellt haben, dass die Konfiguration auf dem neuesten Stand ist, können Sie das Workflow Accelerator-System wieder starten. Kapitel :ref:`starting-effektif` gibt Ihnen weitere Information, wie Sie Workflow Accelerator starten.

source: During the first startup the Workflow Accelerator system will migrate the database if there are any outstanding schema changes. Therefore, the startup might take a short while depending on the size of your database. If the system doesn't become available again within minutes, please check the Workflow Accelerator log file for any new error reports.
de: Während der initialen Installation haben Sie einige Konfigurationsdateien bearbeitet und die Workflow Accelerator-Lizenzdatei installiert. Um diese Änderungen nicht zu verlieren, müssen die entsprechenden Konfigurationsdateien sichern und dafür an eine andere Stelle kopieren bevor Sie das Workflow Accelerator-System aktualisieren. Sie finden die entsprechenden Dateien in dem Verzeichnis ``$TOMCAT_HOME/webapps/ROOT/WEB-INF/classes``\ .

source: Restore an older version
de: Eine ältere Version wieder herstellen

source: In case of exceptional problems you might want to restore an older version of Workflow Accelerator. Be aware, if you revert Workflow Accelerator to an older version, it is not guaranteed that you can keep on using your current database. The upgrade to a newer version can involve schema changes that render the database incompatible with older versions of Workflow Accelerator. In this situation, the Workflow Accelerator system will not start if it detects a newer version of the database schema which it doesn't support. This is the reason why you should create a backup before updating the system.
de: Im Falle eines außergewöhnlichen Fehlers kann es notwendig sein, das System wieder auf eine ältere Version von Workflow Accelerator zurückzusetzen. Seien Sie sich bitte bewusst, dass es keine Garantie gibt, dass Sie eine ältere Version von Workflow Accelerator mit der aktuellen Datenbank betreiben können. Die Aktualisierung von Workflow Accelerator auf eine neuere Version kann Änderungen im Datenbankschema nach sich ziehen, die wiederum die Datenbank inkompatibel zu älteren Versionen von Workflow Accelerator machen. In diesen Situation wird das Workflow Accelerator-System nicht starten, wenn es eine neuere Datenbankversion als die vom System unterstützte Version erkennt. Aus diesem Grund sollten Sie vor jeder Aktualisierung ein Backup der Datenbank anlegen.

source: In order to restore an older version, you can follow the instructions in this chapter again. However, instead of creating a backup you should restore an older backup.
de: Um eine ältere Version wieder herzustellen, können Sie wiederum den Anweisungen in diesem Kapitel folgen. Jedoch statt ein Backup anzulegen, müssen Sie nun ein zuvor erstelltes Backup wieder herstellen.

source: Unpack the older version of Workflow Accelerator, see :ref:`update-unpack-effektif`
de: Entpacken Sie die ältere Version vonWorkflow Accelerator, vgl. :ref:`update-unpack-effektif`

source: Stop the Workflow Accelerator system, see :ref:`update-stop-effektif`
de: Stoppen Sie das Workflow Accelerator-System, vgl. :ref:`update-stop-effektif`

source: Restore an earlier back up that was taken while the old Workflow Accelerator version was deployed. See chapter :ref:`restore` for more information on how to restore a backup.
de: Stellen Sie nun ein Backup der Datenbank wieder her, welches erstellt wurde, während die alte Workflow Accelerator-Version installiert war. Im Kapitel :ref:`restore` finden Sie weitere Hinweise, wie Sie ein Backup wieder herstellen können.

source: Backup the configuration files, see :ref:`update-backup-configuration`
de: Sichern Sie die Konfigurationsdateien, vgl. :ref:`update-backup-configuration`

source: Install the older version of the webapp in ``$TOMCAT_HOME/webapps``\ , see :ref:`update-install-version`
de: Installieren Sie die ältere Version der Webanwendung in ``$TOMCAT_HOME/webapps``\ , vgl. :ref:`update-install-version`

source: Install the older version of the script engine in ``$SCRIPT_ENGINE_HOME``, see :ref:`update-install-version`
de: Installieren Sie die ältere Version der Script Engine in ``$SCRIPT_ENGINE_HOME``\ , vgl. :ref:`update-install-version`

source: Install the older version of the mail relay in ``$MAIL_RELAY_HOME``, see :ref:`update-install-version`
de: Installieren Sie die ältere Version des Mail Relay in ``$MAIL_RELAY_HOME``, vgl. :ref:`update-install-version`

source: Check the configuration files again, see :ref:`update-revisit-configuration`
de: Überprüfen Sie die Konfigurationsdateien erneut, vgl. :ref:`update-revisit-configuration`

source: Start the Workflow Accelerator system, see :ref:`starting-effektif`
de: Starten Sie das Workflow Accelerator-System, vgl. :ref:`starting-effektif`

source: Now, the Workflow Accelerator system should be running with the older version again.
de: Jetzt sollte das Workflow Accelerator-System wieder mit der alten Version laufen.
